# 2018.01.23

INS_TYPE = ['健保', '自費']
APPLY_TYPE = ['申報', '不申報']
VISIT = ['初診', '複診']
REG_TYPE = ['一般門診', '預約門診', '夜間急診']
INJURY_TYPE = ['普通疾病', '職業傷害', '職業病']
SHARE_TYPE = ['基層醫療', '榮民', '低收入戶', '重大傷病', '職業傷害', '三歲兒童']
TREAT_TYPE = ['內科', '傷骨科', '針灸科']
REGIST_FEE_TREAT_TYPE = ['內科', '傷科首次', '傷科療程', '針灸首次', '針灸療程']
CARD = ['自動取得',
        '欠卡',
        'A000 讀卡設備故障',
        'B000 卡片不良',
        '不需取得']
COURSE = [None, '1', '2', '3', '4', '5', '6']
ROOM = ['1', '2', '3', '5', '6', '7', '8', '9', '10']
PERIOD = ['早班', '午班', '晚班']
NATIONALITY = [None, '本國', '外國']
MARRIAGE = [None, '未婚', '已婚']
EDUCATION = [None, '國小', '國中', '高中', '大專', '碩士', '博士', '其他']
OCCUPATION = [None, '工', '商', '農漁業', '軍公教', '自由業', '服務業', '其他']
DISCOUNT = [None, '員工', '眷屬', '親友', '殘障', '僧侶', '教友', '老人', '榮民', '福保']
DIVISION = ['台北業務組', '北區業務組', '中區業務組', '南區業務組', '高屏業務組', '東區業務組']

