# 2018.01.23 nhi_utils.py

import ctypes
import datetime
import os
import sys
from queue import Queue
from threading import Thread

from PyQt5 import QtCore
from PyQt5.QtWidgets import QMessageBox

from libs import (
    case_utils,
    charge_utils,
    date_utils,
    dialog_utils,
    icd10_utils,
    number_utils,
    personnel_utils,
    string_utils,
    system_utils,
)

MAX_DIAG_DAYS = 26  # 合理門診量最大日期
MAX_COURSE = 6  # 療程次數
MAX_HOME_CARE = 15  # 居家醫療次數
MAX_LONG_TERM_CARE = 15  # 照護機構中醫照護次數
MAX_TREAT_DRUG = 150  # 針傷給藥限量
MAX_COMPLICATED_TREAT = 60  # 複雜針限量
MAX_MODERATE_COMPLICATED_ACUPUNCTURE = 100  # 中度複雜針限量
MAX_HIGHLY_COMPLICATED_ACUPUNCTURE = 70  # 高度複雜針限量
MAX_MODERATE_COMPLICATED_MASSAGE = 100  # 中度複雜傷限量 2025-05-01 實施
MAX_HIGHLY_COMPLICATED_MASSAGE = 70  # 高度複雜傷限量 2025-05-01 實施
# MAX_MERGE_TREAT = 80  # 針灸合併傷科治療
MAX_MERGE_TREAT = 60  # 2024-12-20 降為60人次 針灸合併傷科治療
MAX_DISEASE_CODE = 4  # 顯示病名

MAX_DIAG = 8  # 首次次數限制
MAX_TREAT = 20  # 針傷次數限制
MAX_TREAT_TAIPEI = 19  # 台北業務組針傷次數限制

DIAG_SECTION1 = 30  # 合理門診量第一段
DIAG_SECTION2 = 50
DIAG_SECTION3 = 70
DIAG_SECTION4 = 150

TREAT_SECTION1 = 30  # 針傷合理量第一段
# TREAT_SECTION2 = 45
TREAT_SECTION2 = 60  # 2022-03-01 開始實施

INS_CLASS = "60"  # 60-中醫科

LACK_RESOURCE_DISCOUNT_RATE = 20  # 資源不足非山地離島地區部份負擔減免 20%
INS_TREAT_2021_DATE = datetime.date(2021, 3, 1)  # 2021.03.01 針灸傷科處置新制生效日期
VPN_IP = "10.253.249.22"

APPLY_TYPE_CODE = {
    "申報": "1",
    "補報": "2",
}
REMEDY_TYPE_CODE = {
    "補報整筆": "1",
    "補報差額": "2",
}
REPLY_SAMPLE_CODE = {
    "統扣": "0",
    "立意": "1",
    "歸戶": "2",
    "隨機": "3",
    "全審": "4",
}

TREAT_ITEM = {
    "01": "西醫門診",
    "02": "牙醫門診",
    "03": "中醫門診",
    "04": "急診",
    "05": "住院",
    "06": "轉診",
    "07": "門診回診",
    "08": "住院回診",
    "AA": "療程",
    "AB": "療程",
    "AC": "預防保健",
    "AD": "職業傷害",
    "AE": "慢箋",
    "AF": "藥局調劑",
    "AG": "排程檢查",
    "AH": "居家照護",
    "AI": "同日看診",
    "BA": "急診住院",
    "BB": "出院",
    "BC": "急診住院中",
    "BD": "急診離院",
    "BE": "職傷住院",
    "CA": "其他",
    "DA": "門診轉出",
    "DB": "門診手術",
}

# 針傷給藥代碼  # 打折用
TREAT_DRUG_CODE = [
    "B41",
    "B43",
    "B45",
    "B53",
    "B62",
    "B80",
    "B85",
    "B90",
    "D01",
    "D03",
    "D05",
    "D07",
    "E01",
    "E03",
    "E05",
    "E07",
    "E09",
    "E11",
    "F01",
    "F04",
    "F07",
    "F10",
    "F13",
    "F16",
    "F18",
    "F21",
    "F24",
    "F27",
    "F30",
    "F33",
    "F35",
    "F38",
    "F41",
    "F44",
    "F47",
    "F50",
    "F52",
    "F55",
    "F58",
    "F61",
    "F64",
    "F67",
]

REGIST_TYPEX = ["內科", "皮膚科", "腸胃科", "婦科", "傷科"]

# 針傷未開藥代碼  #　打折用
TREAT_CODE = [
    "B42",
    "B44",
    "B46",
    "B54",
    "B61",
    "B63",
    "B81",
    "B86",
    "B91",
    "D02",
    "D04",
    "D06",
    "D08",
    "E02",
    "F02",
    "F36",
    "F53",
    "F19",
]

TREAT_ALL_CODE = [  # 所有針傷處置代碼
    "B41",
    "B42",
    "B43",
    "B44",
    "B45",
    "B46",
    "B53",
    "B54",
    "B55",
    "B56",
    "B57",
    "B61",
    "B62",
    "B63",
    "B80",
    "B81",
    "B82",
    "B83",
    "B84",
    "B85",
    "B85",
    "B86",
    "B87",
    "B88",
    "B89",
    "B90",
    "B91",
    "B92",
    "B93",
    "B94",
    "D01",
    "D02",
    "D03",
    "D04",
    "D05",
    "D06",
    "D07",
    "D08",
    "E01",
    "E02",
    "E03",
    "E04",
    "E05",
    "E06",
    "E07",
    "E08",
    "E09",
    "E10",
    "E11",
    "E12",
    "F01",
    "F02",
    "F03",
    "F04",
    "F05",
    "F06",
    "F07",
    "F08",
    "F09",
    "F10",
    "F11",
    "F12",
    "F13",
    "F14",
    "F15",
    "F16",
    "F17",
    "F18",
    "F19",
    "F20",
    "F21",
    "F22",
    "F23",
    "F24",
    "F25",
    "F26",
    "F27",
    "F28",
    "F29",
    "F30",
    "F31",
    "F32",
    "F33",
    "F34",
    "F35",
    "F36",
    "F37",
    "F38",
    "F39",
    "F40",
    "F41",
    "F42",
    "F43",
    "F44",
    "F45",
    "F46",
    "F47",
    "F48",
    "F49",
    "F50",
    "F51",
    "F52",
    "F53",
    "F54",
    "F55",
    "F56",
    "F57",
    "F58",
    "F59",
    "F60",
    "F61",
    "F62",
    "F63",
    "F64",
    "F65",
    "F66",
    "F67",
    "F68",
    "F69",
    "F70",
    "F73",
    "F74",
    "F77",
    "F78",
    "F81",
    "F82",
]

MODERATE_COMPLICATED_ACUPUNCTURE_CODE = [
    "D05",
    "D06",
    "F35",
    "F36",
    "F37",
    "F38",
    "F39",
    "F40",
    "F41",
    "F42",
    "F43",
    "F44",
    "F45",
    "F46",
    "F47",
    "F48",
    "F49",
    "F50",
    "F51",
]

HIGHLY_COMPLICATED_ACUPUNCTURE_CODE = [
    "D07",
    "D08",
    "F52",
    "F53",
    "F54",
    "F55",
    "F56",
    "F57",
    "F58",
    "F59",
    "F60",
    "F61",
    "F62",
    "F63",
    "F64",
    "F65",
    "F66",
    "F67",
    "F68",
]

MERGE_TREAT_CODE = [
    "F01",
    "F02",
    "F03",
    "F04",
    "F05",
    "F06",
    "F07",
    "F08",
    "F09",
    "F10",
    "F11",
    "F12",
    "F13",
    "F14",
    "F15",
    "F16",
    "F17",
    "F18",
    "F19",
    "F20",
    "F21",
    "F22",
    "F23",
    "F24",
    "F25",
    "F26",
    "F27",
    "F28",
    "F29",
    "F30",
    "F31",
    "F32",
    "F33",
    "F34",
    "F35",
    "F36",
    "F37",
    "F38",
    "F39",
    "F40",
    "F41",
    "F42",
    "F43",
    "F44",
    "F45",
    "F46",
    "F47",
    "F48",
    "F49",
    "F50",
    "F51",
    "F52",
    "F53",
    "F54",
    "F55",
    "F56",
    "F57",
    "F58",
    "F59",
    "F60",
    "F61",
    "F62",
    "F63",
    "F64",
    "F65",
    "F66",
    "F67",
    "F68",
    "F69",
    "F70",
    "F73",
    "F74",
    "F77",
    "F78",
    "F81",
    "F82",
]

COMPLICATED_ACUPUNCTURE_CODE = (
    MODERATE_COMPLICATED_ACUPUNCTURE_CODE + HIGHLY_COMPLICATED_ACUPUNCTURE_CODE
)

MODERATE_COMPLICATED_MASSAGE_CODE = [
    "E03",
    "E04",
]

HIGHLY_COMPLICATED_MASSAGE_CODE = [
    "E05",
    "E06",
    "E07",
    "E08",
    "E09",
    "E10",
    "E11",
    "E12",
]

COMPLICATED_MASSAGE_CODE = (
    MODERATE_COMPLICATED_MASSAGE_CODE + HIGHLY_COMPLICATED_MASSAGE_CODE
)

# COMPLICATED_TREAT_CODE = [
#     'B55', 'B56', 'B57',
#     'B82', 'B83', 'B84', 'B87', 'B88', 'B89',
#     'B92', 'B93', 'B94',
# ]

COMPLICATED_TREAT_CODE = (
    COMPLICATED_ACUPUNCTURE_CODE + COMPLICATED_MASSAGE_CODE + MERGE_TREAT_CODE
)

PHARMACY_TYPE_DICT = {
    "0": "自行調劑",
    "1": "交付調劑",
    "2": "未開處方",
}

EXCLUDE_DIAG_ADJUST = ["22", "25", "30", "31", "B6", "C5"]

INS_TYPE = ["健保", "自費"]

REMEDY_TYPE = ["補報整筆", "補報差額"]
APPLY_TYPE = ["申報", "不申報"] + REMEDY_TYPE

PHARMACY_APPLY_TYPE = ["申報", "不申報"]
VISIT = ["複診", "初診"]

AT_LACK_AREA = ["位於資源不足地區"]
GOTO_LACK_AREA = ["前往資源不足地區"]
OPEN_LACK_AREA = ["資源不足開業"]
LACK_AREA = AT_LACK_AREA + GOTO_LACK_AREA + OPEN_LACK_AREA
LACK_RESOURCE_TYPE = (
    AT_LACK_AREA
    + GOTO_LACK_AREA
    + OPEN_LACK_AREA
    + ["資源不足巡迴醫療", "偏遠地區長期進駐"]
)

TOUR_FAR = ["巡迴偏遠"]
TOUR_MOUNTAIN_ISLAND = ["巡迴山地", "巡迴離島"]
TOUR_TYPE = TOUR_FAR + TOUR_MOUNTAIN_ISLAND

TOUR_TYPE_WITH_GOTO_LACK_AREA = TOUR_TYPE + GOTO_LACK_AREA

LONG_TERM_CARE = ["照護機構中醫照護"]
TELECOM_TYPE = ["視訊門診", "電話門診"]
INFECTIOUS_TYPE = ["法定傳染病通報隔離"]
SPECIAL_PHARMACY_TYPE = [
    "預定出國領藥",
    "返回離島領藥",
    "遠洋漁船船員領藥",
    "國際航線船員領藥",
    "罕見疾病領藥",
    "行動不便代領",
    "遠洋漁船船員代領",
    "國際航線船員代領",
    "特殊情形代領",
]

RESOURCE_TYPE = ["一般"] + LACK_RESOURCE_TYPE
GENERAL_REG_TYPE = ["一般門診", "預約門診", "夜間急診"]
CORRECTION_REG_TYPE = ["矯正機關內門診", "戒護就醫"]

REG_TYPE = (  # 2023.03.20 停止
    GENERAL_REG_TYPE
    + LONG_TERM_CARE
    + TOUR_TYPE
    + LACK_RESOURCE_TYPE
    + INFECTIOUS_TYPE
    + TELECOM_TYPE
    + SPECIAL_PHARMACY_TYPE
    + CORRECTION_REG_TYPE
)
# REG_TYPE = (  # current
#     GENERAL_REG_TYPE + LONG_TERM_CARE + TOUR_TYPE + LACK_RESOURCE_TYPE +
#     SPECIAL_PHARMACY_TYPE + CORRECTION_REG_TYPE
# )

OUTPATIENT_TYPE = ["院內門診", "院外出診"]

GENERAL_INJURY_TYPE = ["普通疾病"]

CHIEF_COMPLAINT_OCCUPATIONAL_INJURY_TYPE = ["主訴職災"]
MAIN_OCCUPATIONAL_INJURY_TYPE = ["職業傷害", "職業病"]
OCCUPATIONAL_INJURY_TYPE = (
    CHIEF_COMPLAINT_OCCUPATIONAL_INJURY_TYPE + MAIN_OCCUPATIONAL_INJURY_TYPE
)

OCCUPATIONAL_INJURY_CARD = "IC06"

INFECTIOUS_INJURY_TYPE = ["法定傳染病通報隔離"]
INFECTIOUS_INJURY_CARD = "HVIT"

INJURY_TYPE = (  # 2023.03.20 停止
    GENERAL_INJURY_TYPE + OCCUPATIONAL_INJURY_TYPE + INFECTIOUS_INJURY_TYPE
)
# INJURY_TYPE = (  # current
#     GENERAL_INJURY_TYPE + OCCUPATIONAL_INJURY_TYPE
# )

INSURED_TYPE = ["基層醫療", "榮民", "低收入戶", "重大傷病", "中低收入戶", "災民"]
NON_SHARE_TYPE = [  # 2023.03.20 停止
    "榮民",
    "低收入戶",
    "重大傷病",
    "職業傷害",
    "法定傳染病通報隔離",
    "三歲兒童",
    "山地離島",
    "其他免部份負擔",
    "新生兒",
    "愛滋病",
    "替代役男",
    "天然災害",
]

SHARE_TYPE = INSURED_TYPE + NON_SHARE_TYPE
# SHARE_TYPE = INSURED_TYPE + [  # current
#     '重大傷病', '職業傷害', '三歲兒童',
#     '山地離島', '其他免部份負擔', '新生兒', '愛滋病', '替代役男', '天然災害',
# ]
AGENT_SHARE = [
    "榮民",
    "低收入戶",
    "災民",
    "職業傷害",
    "三歲兒童",
    "新生兒",
    "愛滋病",
    "替代役男",
    "天然災害",
]
# AGENT_SHARE = [
#     '榮民', '低收入戶', '職業傷害', '三歲兒童',
#     '新生兒', '愛滋病', '替代役男', '天然災害',
# ] + INFECTIOUS_INJURY_TYPE

GENERAL_ACUPUNCTURE_TREAT = [
    "針灸治療",
    "電針治療",
    "複雜針灸",
    "一般針灸",
    "電針",
    "一般針灸合併一般傷科",
]

MERGE_TREAT = [
    "一般針灸合併一般傷科",
    "一般針灸合併中度傷科",
    "一般針灸合併高度傷科",
    "一般針灸合併中度傷科合併特殊疾病",
    "一般針灸合併脫臼整復復位",
    "一般針灸合併骨折復位",
    "電針合併一般傷科",
    "電針合併中度傷科",
    "電針合併高度傷科",
    "電針合併中度傷科合併特殊疾病",
    "電針合併脫臼整復復位",
    "電針合併骨折復位",
    "中度針灸合併一般傷科",
    "中度針灸合併中度傷科",
    "中度針灸合併高度傷科",
    "中度針灸合併中度傷科合併特殊疾病",
    "中度針灸合併脫臼整復復位",
    "中度針灸合併骨折復位",
    "高度針灸合併一般傷科",
    "高度針灸合併中度傷科",
    "高度針灸合併高度傷科",
    "高度針灸合併中度傷科合併特殊疾病",
    "高針合併中傷合併特殊疾病",
    "高度針灸合併脫臼整復復位",
    "高度針灸合併骨折復位",
]

COMPLICATED_MERGE_TREAT = [
    "一般針灸合併中度傷科",
    "一般針灸合併高度傷科",
    "一般針灸合併中度傷科合併特殊疾病",
    "一般針灸合併脫臼整復復位",
    "一般針灸合併骨折復位",
    "電針合併中度傷科",
    "電針合併高度傷科",
    "電針合併中度傷科合併特殊疾病",
    "電針合併脫臼整復復位",
    "電針合併骨折復位",
    "中度針灸合併一般傷科",
    "中度針灸合併中度傷科",
    "中度針灸合併高度傷科",
    "中度針灸合併中度傷科合併特殊疾病",
    "中度針灸合併脫臼整復復位",
    "中度針灸合併骨折復位",
    "高度針灸合併一般傷科",
    "高度針灸合併中度傷科",
    "高度針灸合併高度傷科",
    "高度針灸合併中度傷科合併特殊疾病",
    "高針合併中傷合併特殊疾病",
    "高度針灸合併脫臼整復復位",
    "高度針灸合併骨折復位",
]


MERGE_TREAT_LIST = [
    "一般針灸合併一般傷科",
    "一般針灸合併中度傷科",
    "一般針灸合併中度傷科療程2-6次",
    "一般針灸合併高度傷科",
    "一般針灸合併高度傷科起始次",
    "一般針灸合併高度傷科後續治療",
    "一般針灸合併中度傷科合併特殊疾病",
    "一般針灸合併中度傷科合併特殊疾病起始次",
    "一般針灸合併中度傷科合併特殊疾病後續治療",
    "一般針灸合併脫臼整復復位",
    "一般針灸合併脫臼整復復位起始次",
    "一般針灸合併脫臼整復復位後續治療",
    "一般針灸合併骨折復位",
    "一般針灸合併骨折復位起始次",
    "一般針灸合併骨折復位後續治療",
    "電針合併一般傷科",
    "電針合併中度傷科",
    "電針合併中度傷科療程2-6次",
    "電針合併高度傷科",
    "電針合併高度傷科起始次",
    "電針合併高度傷科後續治療",
    "電針合併中度傷科合併特殊疾病",
    "電針合併中度傷科合併特殊疾病起始次",
    "電針合併中度傷科合併特殊疾病後續治療",
    "電針合併脫臼整復復位",
    "電針合併脫臼整復復位起始次",
    "電針合併脫臼整復復位後續治療",
    "電針合併骨折復位",
    "電針合併骨折復位起始次",
    "電針合併骨折復位後續治療",
    "中度針灸合併一般傷科",
    "中度針灸合併中度傷科",
    "中度針灸合併中度傷科療程2-6次",
    "中度針灸合併高度傷科",
    "中度針灸合併高度傷科起始次",
    "中度針灸合併高度傷科後續治療",
    "中度針灸合併中度傷科合併特殊疾病",
    "中度針灸合併中度傷科合併特殊疾病起始次",
    "中度針灸合併中度傷科合併特殊疾病後續治療",
    "中度針灸合併脫臼整復復位",
    "中度針灸合併脫臼整復復位起始次",
    "中度針灸合併脫臼整復復位後續治療",
    "中度針灸合併骨折復位",
    "中度針灸合併骨折復位起始次",
    "中度針灸合併骨折復位後續治療",
    "高度針灸合併一般傷科",
    "高度針灸合併中度傷科",
    "高度針灸合併中度傷科療程2-6次",
    "高度針灸合併高度傷科",
    "高度針灸合併高度傷科起始次",
    "高度針灸合併高度傷科後續治療",
    "高度針灸合併中度傷科合併特殊疾病",
    "高度針灸合併中度傷科合併特殊疾病起始次",
    "高度針灸合併中度傷科合併特殊疾病後續治療",
    "高針合併中傷合併特殊疾病",
    "高針合併中傷合併特殊疾病起始次",
    "高針合併中傷合併特殊疾病後續治療",
    "高度針灸合併脫臼整復復位",
    "高度針灸合併脫臼整復復位起始次",
    "高度針灸合併脫臼整復復位後續治療",
    "高度針灸合併骨折復位",
    "高度針灸合併骨折復位起始次",
    "高度針灸合併骨折復位後續治療",
]

COMPLICATED_MERGE_TREAT_LIST = [
    "一般針灸合併中度傷科",
    "一般針灸合併中度傷科療程2-6次",
    "一般針灸合併高度傷科",
    "一般針灸合併高度傷科起始次",
    "一般針灸合併高度傷科後續治療",
    "一般針灸合併中度傷科合併特殊疾病",
    "一般針灸合併中度傷科合併特殊疾病起始次",
    "一般針灸合併中度傷科合併特殊疾病後續治療",
    "一般針灸合併脫臼整復復位",
    "一般針灸合併脫臼整復復位起始次",
    "一般針灸合併脫臼整復復位後續治療",
    "一般針灸合併骨折復位",
    "一般針灸合併骨折復位起始次",
    "一般針灸合併骨折復位後續治療",
    "電針合併中度傷科",
    "電針合併中度傷科療程2-6次",
    "電針合併高度傷科",
    "電針合併高度傷科起始次",
    "電針合併高度傷科後續治療",
    "電針合併中度傷科合併特殊疾病",
    "電針合併中度傷科合併特殊疾病起始次",
    "電針合併中度傷科合併特殊疾病後續治療",
    "電針合併脫臼整復復位",
    "電針合併脫臼整復復位起始次",
    "電針合併脫臼整復復位後續治療",
    "電針合併骨折復位",
    "電針合併骨折復位起始次",
    "電針合併骨折復位後續治療",
    "中度針灸合併一般傷科",
    "中度針灸合併中度傷科",
    "中度針灸合併中度傷科療程2-6次",
    "中度針灸合併高度傷科",
    "中度針灸合併高度傷科起始次",
    "中度針灸合併高度傷科後續治療",
    "中度針灸合併中度傷科合併特殊疾病",
    "中度針灸合併中度傷科合併特殊疾病起始次",
    "中度針灸合併中度傷科合併特殊疾病後續治療",
    "中度針灸合併脫臼整復復位",
    "中度針灸合併脫臼整復復位起始次",
    "中度針灸合併脫臼整復復位後續治療",
    "中度針灸合併骨折復位",
    "中度針灸合併骨折復位起始次",
    "中度針灸合併骨折復位後續治療",
    "高度針灸合併一般傷科",
    "高度針灸合併中度傷科",
    "高度針灸合併中度傷科療程2-6次",
    "高度針灸合併高度傷科",
    "高度針灸合併高度傷科起始次",
    "高度針灸合併高度傷科後續治療",
    "高度針灸合併中度傷科合併特殊疾病",
    "高度針灸合併中度傷科合併特殊疾病起始次",
    "高度針灸合併中度傷科合併特殊疾病後續治療",
    "高針合併中傷合併特殊疾病",
    "高針合併中傷合併特殊疾病起始次",
    "高針合併中傷合併特殊疾病後續治療",
    "高度針灸合併脫臼整復復位",
    "高度針灸合併脫臼整復復位起始次",
    "高度針灸合併脫臼整復復位後續治療",
    "高度針灸合併骨折復位",
    "高度針灸合併骨折復位起始次",
    "高度針灸合併骨折復位後續治療",
]

MODERATE_COMPLICATED_ACUPUNCTURE_LIST = [
    "中度複雜性針灸",
    "中度針灸合併一般傷科",
    "中度針灸合併中度傷科",
    "中度針灸合併中度傷科療程2-6次",
    "中度針灸合併高度傷科",
    "中度針灸合併高度傷科起始次",
    "中度針灸合併高度傷科後續治療",
    "中度針灸合併中度傷科合併特殊疾病",
    "中度針灸合併中度傷科合併特殊疾病起始次",
    "中度針灸合併中度傷科合併特殊疾病後續治療",
    "中度針灸合併脫臼整復復位",
    "中度針灸合併脫臼整復復位起始次",
    "中度針灸合併脫臼整復復位後續治療",
    "中度針灸合併骨折復位",
    "中度針灸合併骨折復位起始次",
    "中度針灸合併骨折復位後續治療",
]

HIGHLY_COMPLICATED_ACUPUNCTURE_LIST = [
    "高度複雜性針灸",
    "高度針灸合併一般傷科",
    "高度針灸合併中度傷科",
    "高度針灸合併中度傷科療程2-6次",
    "高度針灸合併高度傷科",
    "高度針灸合併高度傷科起始次",
    "高度針灸合併高度傷科後續治療",
    "高度針灸合併中度傷科合併特殊疾病",
    "高度針灸合併中度傷科合併特殊疾病起始次",
    "高度針灸合併中度傷科合併特殊疾病後續治療",
    "高針合併中傷合併特殊疾病",
    "高針合併中傷合併特殊疾病起始次",
    "高針合併中傷合併特殊疾病後續治療",
    "高度針灸合併脫臼整復復位",
    "高度針灸合併脫臼整復復位起始次",
    "高度針灸合併脫臼整復復位後續治療",
    "高度針灸合併骨折復位",
    "高度針灸合併骨折復位起始次",
    "高度針灸合併骨折復位後續治療",
]

MODERATE_COMPLICATED_MASSAGE_LIST = [
    "中度複雜性傷科",
    "一般針灸合併中度傷科",
    "一般針灸合併中度傷科療程2-6次",
    "電針合併中度傷科",
    "電針合併中度傷科療程2-6次",
    "中度針灸合併中度傷科",
    "中度針灸合併中度傷科療程2-6次",
    "高度針灸合併中度傷科",
    "高度針灸合併中度傷科療程2-6次",
]

HIGHLY_COMPLICATED_MASSAGE_LIST = [
    "高度複雜性傷科",
    "一般針灸合併高度傷科",
    "一般針灸合併高度傷科起始次",
    "一般針灸合併高度傷科後續治療",
    "電針合併高度傷科",
    "電針合併高度傷科起始次",
    "電針合併高度傷科後續治療",
    "中度針灸合併高度傷科",
    "中度針灸合併高度傷科起始次",
    "中度針灸合併高度傷科後續治療",
    "高度針灸合併高度傷科",
    "高度針灸合併高度傷科起始次",
    "高度針灸合併高度傷科後續治療",
    "一般針灸合併中度傷科合併特殊疾病",
    "一般針灸合併中度傷科合併特殊疾病起始次",
    "一般針灸合併中度傷科合併特殊疾病後續治療",
    "電針合併中度傷科合併特殊疾病",
    "電針合併中度傷科合併特殊疾病起始次",
    "電針合併中度傷科合併特殊疾病後續治療",
    "中度針灸合併中度傷科合併特殊疾病",
    "中度針灸合併中度傷科合併特殊疾病起始次",
    "中度針灸合併中度傷科合併特殊疾病後續治療",
    "高度針灸合併中度傷科合併特殊疾病",
    "高度針灸合併中度傷科合併特殊疾病起始次",
    "高度針灸合併中度傷科合併特殊疾病後續治療",
    "高針合併中傷合併特殊疾病",
    "高針合併中傷合併特殊疾病起始次",
    "高針合併中傷合併特殊疾病後續治療",
    "中度複雜性傷科合併特殊疾病",
    "中度複雜性傷科合併特殊疾病起始次",
    "中度複雜性傷科合併特殊疾病後續治療",
]

COMPLICATED_ACUPUNCTURE_TREAT = (
    MODERATE_COMPLICATED_ACUPUNCTURE_LIST + HIGHLY_COMPLICATED_ACUPUNCTURE_LIST
)
ACUPUNCTURE_TREAT = (
    GENERAL_ACUPUNCTURE_TREAT + MERGE_TREAT + COMPLICATED_ACUPUNCTURE_TREAT
)

ORDINARY_ACUPUNCTURE_TREAT = ["針灸治療", "一般針灸", "電針"]
ORDINARY_MASSAGE_TREAT = ["傷科治療", "一般傷科"]

SELECTION_ACUPUNCTURE_TREAT = ["一般針灸", "電針", "中度複雜性針灸", "高度複雜性針灸"]
SELECTION_MASSAGE_TREAT = [
    "一般傷科",
    "中度複雜性傷科",
    "高度複雜性傷科",
    "中度複雜性傷科合併特殊疾病",
    "高針合併中傷合併特殊疾病",
    "脫臼整復復位",
    "骨折復位",
]

PRIMARY_ACUPUNCTURE_TREAT = [
    "一般針灸",
    "電針",
    "中度複雜性針灸",
    "中度針灸",
    "高度複雜性針灸",
    "高度針灸",
]
SECONDARY_MASSAGE_TREAT = [
    "中度複雜性傷科合併特殊疾病",
    "中度傷科合併特殊疾病",
    "脫臼整復復位",
    "骨折復位",
    "高度複雜性傷科",
    "高度傷科",
    "中度複雜性傷科",
    "中度傷科",
    "一般傷科",
]
ACUPUNCTURE_MERGE_TREAT = [
    "一般針灸合併骨折復位起始次",
    "一般針灸合併骨折復位後續治療",
    "一般針灸合併脫臼整復復位起始次",
    "一般針灸合併脫臼整復復位後續治療",
    "一般針灸合併中度傷科合併特殊疾病起始次",
    "一般針灸合併中度傷科合併特殊疾病後續治療",
    "一般針灸合併高度傷科起始次",
    "一般針灸合併高度傷科後續治療",
    "一般針灸合併中度傷科",
    "一般針灸合併中度傷科療程2-6次",
    "一般針灸合併一般傷科",
    "電針合併骨折復位起始次",
    "電針合併骨折復位後續治療",
    "電針合併脫臼整復復位起始次",
    "電針合併脫臼整復復位後續治療",
    "電針合併中度傷科合併特殊疾病起始次",
    "電針合併中度傷科合併特殊疾病後續治療",
    "電針合併高度傷科起始次",
    "電針合併高度傷科後續治療",
    "電針合併中度傷科",
    "電針合併中度傷科療程2-6次",
    "電針合併一般傷科",
    "中度針灸合併骨折復位起始次",
    "中度針灸合併骨折復位後續治療",
    "中度針灸合併脫臼整復復位起始次",
    "中度針灸合併脫臼整復復位後續治療",
    "中度針灸合併中度傷科合併特殊疾病起始次",
    "中度針灸合併中度傷科合併特殊疾病後續治療",
    "中度針灸合併高度傷科起始次",
    "中度針灸合併高度傷科後續治療",
    "中度針灸合併中度傷科",
    "中度針灸合併中度傷科療程2-6次",
    "中度針灸合併一般傷科",
    "高度針灸合併骨折復位起始次",
    "高度針灸合併骨折復位後續治療",
    "高度針灸合併脫臼整復復位起始次",
    "高度針灸合併脫臼正整復復位後續治療",
    "高度針灸合併中度傷科合併特殊疾病起始次",
    "高度針灸合併中度傷科合併特殊疾病後續治療",
    "高度針灸合併高度傷科起始次",
    "高度針灸合併高度傷科後續治療",
    "高度針灸合併中度傷科",
    "高度針灸合併中度傷科療程2-6次",
    "高度針灸合併一般傷科",
    "高度針灸合併電針",
]

GENERAL_MASSAGE_TREAT = [
    "傷科治療",
    "複雜傷科",
    "一般傷科",
]
MODERATE_COMPLICATED_MASSAGE_TREAT = [
    "中度複雜性傷科",
]
HIGHLY_COMPLICATED_MASSAGE_TREAT = [
    "高度複雜性傷科",
    "中度複雜性傷科合併特殊疾病",
]
COMPLICATED_MASSAGE_TREAT = (
    MODERATE_COMPLICATED_MASSAGE_TREAT + HIGHLY_COMPLICATED_MASSAGE_TREAT
)
MASSAGE_TREAT = GENERAL_MASSAGE_TREAT + COMPLICATED_MASSAGE_TREAT

DISLOCATE_TREAT = [
    "脫臼復位",
    "脫臼整復首次",
    "脫臼整復",
    "脫臼整復復位",
    "骨折復位",
]

ACUPUNCTURE_TREAT_2020 = [
    "針灸治療",
    "電針治療",
    "複雜針灸",
]
MASSAGE_TREAT_2020 = [
    "傷科治療",
    "複雜傷科",
]
DISLOCATE_TREAT_2020 = [
    "脫臼復位",
    "脫臼整復首次",
    "脫臼整復",
]

ACUPUNCTURE_TREAT_2021 = [
    "一般針灸",
    "電針",
    "一般針灸合併一般傷科",
] + COMPLICATED_ACUPUNCTURE_TREAT
MASSAGE_TREAT_2021 = ["一般傷科"] + COMPLICATED_MASSAGE_TREAT

DISLOCATE_TREAT_2021 = ["脫臼整復復位", "骨折復位"]

INS_TREAT_2020 = ACUPUNCTURE_TREAT_2020 + MASSAGE_TREAT_2020 + DISLOCATE_TREAT_2020
INS_TREAT_2021 = ACUPUNCTURE_TREAT_2021 + MASSAGE_TREAT_2021 + DISLOCATE_TREAT_2021
INS_TREAT = ACUPUNCTURE_TREAT + MERGE_TREAT_LIST + MASSAGE_TREAT + DISLOCATE_TREAT

# 案件分類: 30
CHILD_CARE_TREAT = ["小兒氣喘", "小兒腦性麻痺"]
BRAIN_CARE_TREAT = ["腦血管疾病"]
AUXILIARY_CARE_TREAT = CHILD_CARE_TREAT + BRAIN_CARE_TREAT

# 案件分類: 22
PREGNANT_CARE_TREAT = ["助孕照護", "保胎照護"]
CANCER_CARE_TREAT = [
    "乳癌照護",
    "肝癌照護",
    "肺癌照護",
    "大腸癌照護",
    "胃癌照護",
    "攝護腺癌照護",
    "口腔癌照護",
    "子宮頸癌照護",
    "子宮體癌照護",
    "甲狀腺癌照護",
]
KIDNEY_CARE_TREAT = ["慢性腎病照護"]
MISC_CARE_TREAT = ["癌症中醫門診延長照護", "兒童鼻炎"]
IMPROVE_CARE_TREAT = (
    PREGNANT_CARE_TREAT + CANCER_CARE_TREAT + MISC_CARE_TREAT + KIDNEY_CARE_TREAT
)


# 案件分類: 31
HOME_CARE = ["居家醫療"]

CARE_TREAT = AUXILIARY_CARE_TREAT + IMPROVE_CARE_TREAT
ALL_CARE_TREAT = CARE_TREAT + HOME_CARE

SPECIAL_CODE_DICT = {
    "居家醫療": "EC",
    "法定傳染病通報隔離": "EE",
    "助孕照護": "J9",
    "保胎照護": "J9",
    "矯正機關內門診": "JA",
    "戒護就醫": "JB",
    "乳癌照護": "JE",
    "肝癌照護": "JF",
    "兒童鼻炎": "JG",
    "癌症中醫門診延長照護": "JH",
    "肺癌照護": "JI",
    "大腸癌照護": "JJ",
    "胃癌照護": "JT",  # 2025-05-15 新增
    "攝護腺癌照護": "JU",
    "口腔癌照護": "JY",
    "子宮頸癌照護": "MA",
    "子宮體癌照護": "MB",
    "甲狀腺癌照護": "MC",
    "慢性腎病照護": "JP",
    "照護機構中醫照護": "JR",
    "預定出國領藥": "CC",
    "返回離島領藥": "CD",
    "遠洋漁船船員領藥": "CE",
    "國際航線船員領藥": "CF",
    "罕見疾病領藥": "CG",
    "行動不便代領": "J1",
    "遠洋漁船船員代領": "J2",
    "國際航線船員代領": "J3",
    "特殊情形代領": "J4",
}

INS_TREAT_WITH_CARE = INS_TREAT + CARE_TREAT

TRI_HEAT_TREAT = ["三伏貼", "三九貼"]
TRADITIONAL_TREAT = ["民俗調理", "自費健保"] + TRI_HEAT_TREAT
PURCHASE = ["自費", "自購", "加購", "療程實現", "療程實現贈送", "開立證明", "美顏針"]
INTERNAL_TREAT = ["內科", "醫療諮詢"]
TREAT_TYPE = (
    INTERNAL_TREAT + INS_TREAT_WITH_CARE + HOME_CARE + TRADITIONAL_TREAT + PURCHASE
)
SELECT_TREAT_TYPE = (
    INTERNAL_TREAT
    + SELECTION_ACUPUNCTURE_TREAT
    + SELECTION_MASSAGE_TREAT
    + MERGE_TREAT
    + CARE_TREAT
    + HOME_CARE
    + TRADITIONAL_TREAT
    + PURCHASE
)
SELECT_TREAT_TYPE_2020 = (
    INTERNAL_TREAT
    + ACUPUNCTURE_TREAT_2020
    + MASSAGE_TREAT_2020
    + CARE_TREAT
    + HOME_CARE
    + TRADITIONAL_TREAT
    + PURCHASE
)

APPLY_TYPE_DICT = {
    "申報": "1",
    "補報": "2",
}

APPLY_TYPE_NAME_DICT = {
    "1": "申報",
    "2": "補報",
}

INJURY_DICT = {
    "職業傷害": "1",
    "主訴職災": "1",
    "職業病": "2",
    "普通傷害": "3",
    "普通疾病": "4",
    "法定傳染病通報隔離": "W",
    "": "4",
}

ACUPUNCTURE_DRUG_DICT = {
    "針灸治療": "B41",
    "電針治療": "B43",
    "複雜針灸": "B45",
    "一般針灸": "D01",
    "電針": "D03",
    "中度複雜性針灸": "D05",
    "高度複雜性針灸": "D07",
    # ----------------------------------------------------------------
    "一般針灸合併一般傷科": "F01",
    "一般針灸合併一般傷科開藥": "F01",
    "一般針灸合併中度傷科": "F03",
    "一般針灸合併中度傷科開藥": "F03",
    "一般針灸合併中度傷科療程2-6次": "F04",
    "一般針灸合併中度傷科療程2-6次開藥": "F04",
    "一般針灸合併中度傷科不分療程": "F69",
    "一般針灸合併中度傷科不分療程開藥": "F69",
    "一般針灸合併高度傷科": "F06",
    "一般針灸合併高度傷科起始次": "F06",
    "一般針灸合併高度傷科起始次開藥": "F06",
    "一般針灸合併高度傷科後續治療": "F07",
    "一般針灸合併高度傷科後續治療開藥": "F07",
    "一般針灸合併中度傷科合併特殊疾病": "F09",
    "一般針灸合併中度傷科合併特殊疾病起始次": "F09",
    "一般針灸合併中度傷科合併特殊疾病起始次開藥": "F09",
    "一般針灸合併中度傷科合併特殊疾病後續治療": "F10",
    "一般針灸合併中度傷科合併特殊疾病後續治療開藥": "F10",
    "一般針灸合併脫臼整復復位": "F12",
    "一般針灸合併脫臼整復復位起始次": "F12",
    "一般針灸合併脫臼整復復位起始次開藥": "F12",
    "一般針灸合併脫臼整復復位後續治療": "F13",
    "一般針灸合併脫臼整復復位後續治療開藥": "F13",
    "一般針灸合併骨折復位": "F15",
    "一般針灸合併骨折復位起始次": "F15",
    "一般針灸合併骨折復位起始次開藥": "F15",
    "一般針灸合併骨折復位後續治療": "F16",
    "一般針灸合併骨折復位後續治療開藥": "F16",
    # ----------------------------------------------------------------
    "電針合併一般傷科": "F18",
    "電針合併一般傷科開藥": "F18",
    "電針合併中度傷科": "F20",
    "電針合併中度傷科開藥": "F20",
    "電針合併中度傷科療程2-6次": "F21",
    "電針合併中度傷科療程2-6次開藥": "F21",
    "電針合併中度傷科不分療程": "F73",
    "電針合併中度傷科不分療程開藥": "F73",
    "電針合併高度傷科": "F23",
    "電針合併高度傷科起始次": "F23",
    "電針合併高度傷科起始次開藥": "F23",
    "電針合併高度傷科後續治療": "F24",
    "電針合併高度傷科後續治療開藥": "F24",
    "電針合併中度傷科合併特殊疾病": "F26",
    "電針合併中度傷科合併特殊疾病起始次": "F26",
    "電針合併中度傷科合併特殊疾病起始次開藥": "F26",
    "電針合併中度傷科合併特殊疾病後續治療": "F27",
    "電針合併中度傷科合併特殊疾病後續治療開藥": "F27",
    "電針合併脫臼整復復位": "F29",
    "電針合併脫臼整復復位起始次": "F29",
    "電針合併脫臼整復復位起始次開藥": "F29",
    "電針合併脫臼整復復位後續治療": "F30",
    "電針合併脫臼整復復位後續治療開藥": "F30",
    "電針合併骨折復位": "F32",
    "電針合併骨折復位起始次": "F32",
    "電針合併骨折復位起始次開藥": "F32",
    "電針合併骨折復位後續治療": "F33",
    "電針合併骨折復位後續治療開藥": "F33",
    # ----------------------------------------------------------------
    "中度針灸合併一般傷科": "F35",
    "中度針灸合併一般傷科開藥": "F35",
    "中度針灸合併中度傷科": "F37",
    "中度針灸合併中度傷科開藥": "F37",
    "中度針灸合併中度傷科療程2-6次": "F38",
    "中度針灸合併中度傷科療程2-6次開藥": "F38",
    "中度針灸合併中度傷科不分療程": "F77",
    "中度針灸合併中度傷科不分療程開藥": "F77",
    "中度針灸合併高度傷科": "F40",
    "中度針灸合併高度傷科起始次": "F40",
    "中度針灸合併高度傷科起始次開藥": "F40",
    "中度針灸合併高度傷科後續治療": "F41",
    "中度針灸合併高度傷科後續治療開藥": "F41",
    "中度針灸合併中度傷科合併特殊疾病": "F43",
    "中度針灸合併中度傷科合併特殊疾病起始次": "F43",
    "中度針灸合併中度傷科合併特殊疾病起始次開藥": "F43",
    "中度針灸合併中度傷科合併特殊疾病後續治療": "F44",
    "中度針灸合併中度傷科合併特殊疾病後續治療開藥": "F44",
    "中度針灸合併脫臼整復復位": "F46",
    "中度針灸合併脫臼整復復位起始次": "F46",
    "中度針灸合併脫臼整復復位起始次開藥": "F46",
    "中度針灸合併脫臼整復復位後續治療": "F47",
    "中度針灸合併脫臼整復復位後續治療開藥": "F47",
    "中度針灸合併骨折復位起始次": "F49",
    "中度針灸合併骨折復位起始次開藥": "F49",
    "中度針灸合併骨折復位後續治療": "F50",
    "中度針灸合併骨折復位後續治療開藥": "F50",
    # ----------------------------------------------------------------
    "高度針灸合併一般傷科": "F52",
    "高度針灸合併一般傷科開藥": "F52",
    "高度針灸合併中度傷科": "F54",
    "高度針灸合併中度傷科開藥": "F54",
    "高度針灸合併中度傷科療程2-6次": "F55",
    "高度針灸合併中度傷科療程2-6次開藥": "F55",
    "高度針灸合併中度傷科不分療程": "F81",
    "高度針灸合併中度傷科不分療程開藥": "F81",
    "高度針灸合併高度傷科": "F57",
    "高度針灸合併高度傷科起始次": "F57",
    "高度針灸合併高度傷科起始次開藥": "F57",
    "高度針灸合併高度傷科後續治療": "F58",
    "高度針灸合併高度傷科後續治療開藥": "F58",
    "高度針灸合併中度傷科合併特殊疾病": "F60",
    "高度針灸合併中度傷科合併特殊疾病起始次": "F60",
    "高度針灸合併中度傷科合併特殊疾病起始次開藥": "F60",
    "高針合併中傷合併特殊疾病": "F60",
    "高針合併中傷合併特殊疾病起始次": "F60",
    "高針合併中傷合併特殊疾病起始次開藥": "F60",
    "高度針灸合併中度傷科合併特殊疾病後續治療": "F61",
    "高度針灸合併中度傷科合併特殊疾病後續治療開藥": "F61",
    "高度針灸合併脫臼整復復位": "F63",
    "高度針灸合併脫臼整復復位起始次": "F63",
    "高度針灸合併脫臼整復復位起始次開藥": "F63",
    "高度針灸合併脫臼整復復位後續治療": "F64",
    "高度針灸合併脫臼整復復位後續治療開藥": "F64",
    "高度針灸合併骨折復位": "F66",
    "高度針灸合併骨折復位起始次": "F66",
    "高度針灸合併骨折復位起始次開藥": "F66",
    "高度針灸合併骨折復位後續治療": "F67",
    "高度針灸合併骨折復位後續治療開藥": "F67",
}

ACUPUNCTURE_DICT = {
    "針灸治療": "B42",
    "電針治療": "B44",
    "複雜針灸": "B46",
    "一般針灸": "D02",
    "電針": "D04",
    "中度複雜性針灸": "D06",
    "高度複雜性針灸": "D08",
    # ----------------------------------------------------------------
    "一般針灸合併一般傷科": "F02",
    "一般針灸合併一般傷科未開藥": "F02",
    "一般針灸合併中度傷科": "F03",
    "一般針灸合併中度傷科未開藥": "F03",
    "一般針灸合併中度傷科療程2-6次": "F05",
    "一般針灸合併中度傷科療程2-6次未開藥": "F05",
    "一般針灸合併中度傷科不分療程": "F70",
    "一般針灸合併中度傷科不分療程未開藥": "F70",
    "一般針灸合併高度傷科": "F06",
    "一般針灸合併高度傷科起始次": "F06",
    "一般針灸合併高度傷科起始次未開藥": "F06",
    "一般針灸合併高度傷科後續治療": "F08",
    "一般針灸合併高度傷科後續治療未開藥": "F08",
    "一般針灸合併中度傷科合併特殊疾病": "F09",
    "一般針灸合併中度傷科合併特殊疾病起始次": "F09",
    "一般針灸合併中度傷科合併特殊疾病起始次未開藥": "F09",
    "一般針灸合併中度傷科合併特殊疾病後續治療": "F11",
    "一般針灸合併中度傷科合併特殊疾病後續治療未開藥": "F11",
    "一般針灸合併脫臼整復復位": "F12",
    "一般針灸合併脫臼整復復位起始次": "F12",
    "一般針灸合併脫臼整復復位起始次未開藥": "F12",
    "一般針灸合併脫臼整復復位後續治療": "F14",
    "一般針灸合併脫臼整復復位後續治療未開藥": "F14",
    "一般針灸合併骨折復位": "F15",
    "一般針灸合併骨折復位起始次": "F15",
    "一般針灸合併骨折復位起始次未開藥": "F15",
    "一般針灸合併骨折復位後續治療": "F17",
    "一般針灸合併骨折復位後續治療未開藥": "F17",
    # ----------------------------------------------------------------
    "電針合併一般傷科": "F19",
    "電針合併一般傷科未開藥": "F19",
    "電針合併中度傷科": "F20",
    "電針合併中度傷科未開藥": "F20",
    "電針合併中度傷科療程2-6次": "F22",
    "電針合併中度傷科療程2-6次未開藥": "F22",
    "電針合併中度傷科不分療程": "F74",
    "電針合併中度傷科不分療程未開藥": "F74",
    "電針合併高度傷科": "F23",
    "電針合併高度傷科起始次": "F23",
    "電針合併高度傷科起始次未開藥": "F23",
    "電針合併高度傷科後續治療": "F25",
    "電針合併高度傷科後續治療未開藥": "F25",
    "電針合併中度傷科合併特殊疾病": "F26",
    "電針合併中度傷科合併特殊疾病起始次": "F26",
    "電針合併中度傷科合併特殊疾病起始次未開藥": "F26",
    "電針合併中度傷科合併特殊疾病後續治療": "F28",
    "電針合併中度傷科合併特殊疾病後續治療未開藥": "F28",
    "電針合併脫臼整復復位": "F29",
    "電針合併脫臼整復復位起始次": "F29",
    "電針合併脫臼整復復位起始次未開藥": "F29",
    "電針合併脫臼整復復位後續治療": "F31",
    "電針合併脫臼整復復位後續治療未開藥": "F31",
    "電針合併骨折復位": "F32",
    "電針合併骨折復位起始次": "F32",
    "電針合併骨折復位起始次未開藥": "F32",
    "電針合併骨折復位後續治療": "F34",
    "電針合併骨折復位後續治療未開藥": "F45",
    # ----------------------------------------------------------------
    "中度針灸合併一般傷科": "F36",
    "中度針灸合併一般傷科未開藥": "F36",
    "中度針灸合併中度傷科": "F37",
    "中度針灸合併中度傷科未開藥": "F37",
    "中度針灸合併中度傷科療程2-6次": "F39",
    "中度針灸合併中度傷科療程2-6次未開藥": "F39",
    "中度針灸合併中度傷科不分療程": "F78",
    "中度針灸合併中度傷科不分療程未開藥": "F78",
    "中度針灸合併高度傷科": "F40",
    "中度針灸合併高度傷科起始次": "F40",
    "中度針灸合併高度傷科起始次未開藥": "F40",
    "中度針灸合併高度傷科後續治療": "F42",
    "中度針灸合併高度傷科後續治療未開藥": "F42",
    "中度針灸合併中度傷科合併特殊疾病": "F43",
    "中度針灸合併中度傷科合併特殊疾病起始次": "F43",
    "中度針灸合併中度傷科合併特殊疾病起始次未開藥": "F43",
    "中度針灸合併中度傷科合併特殊疾病後續治療": "F45",
    "中度針灸合併中度傷科合併特殊疾病後續治療未開藥": "F45",
    "中度針灸合併脫臼整復復位": "F46",
    "中度針灸合併脫臼整復復位起始次": "F46",
    "中度針灸合併脫臼整復復位起始次未開藥": "F46",
    "中度針灸合併脫臼整復復位後續治療": "F48",
    "中度針灸合併脫臼整復復位後續治療未開藥": "F48",
    "中度針灸合併骨折復位": "F49",
    "中度針灸合併骨折復位起始次": "F49",
    "中度針灸合併骨折復位起始次未開藥": "F49",
    "中度針灸合併骨折復位後續治療": "F51",
    "中度針灸合併骨折復位後續治療未開藥": "F51",
    # ----------------------------------------------------------------
    "高度針灸合併一般傷科": "F53",
    "高度針灸合併一般傷科未開藥": "F53",
    "高度針灸合併中度傷科": "F54",
    "高度針灸合併中度傷科未開藥": "F54",
    "高度針灸合併中度傷科療程2-6次": "F56",
    "高度針灸合併中度傷科療程2-6次未開藥": "F56",
    "高度針灸合併中度傷科不分療程": "F82",
    "高度針灸合併中度傷科不分療程未開藥": "F82",
    "高度針灸合併高度傷科": "F57",
    "高度針灸合併高度傷科起始次": "F57",
    "高度針灸合併高度傷科起始次未開藥": "F57",
    "高度針灸合併高度傷科後續治療": "F59",
    "高度針灸合併高度傷科後續治療未開藥": "F59",
    "高度針灸合併中度傷科合併特殊疾病": "F60",
    "高針合併中傷合併特殊疾病": "F60",  # 2026-07-03 修正
    "高度針灸合併中度傷科合併特殊疾病起始次": "F60",
    "高度針灸合併中度傷科合併特殊疾病起始次未開藥": "F60",
    "高度針灸合併中度傷科合併特殊疾病後續治療": "F62",
    "高度針灸合併中度傷科合併特殊疾病後續治療未開藥": "F62",
    "高度針灸合併脫臼整復復位": "F63",
    "高度針灸合併脫臼整復復位起始次": "F63",
    "高度針灸合併脫臼整復復位起始次未開藥": "F63",
    "高度針灸合併脫臼整復復位後續治療": "F65",
    "高度針灸合併脫臼整復復位後續治療未開藥": "F65",
    "高度針灸合併骨折復位": "F66",
    "高度針灸合併骨折復位起始次": "F66",
    "高度針灸合併骨折復位起始次未開藥": "F66",
    "高度針灸合併骨折復位後續治療": "F68",
    "高度針灸合併骨折復位後續治療未開藥": "F68",
}

MASSAGE_DRUG_DICT = {
    "傷科治療": "B53",
    "複雜傷科": "B55",
    "一般傷科": "E01",
    "中度複雜性傷科": "E03",
    "中度複雜性傷科不分療程": "E13",
    "高度複雜性傷科": "E05",
    # "中度複雜性傷科合併特殊疾病": "F60",  # 2025-08-25 禾豐 (原為E07)
    "中度複雜性傷科合併特殊疾病": "E07",
}
MASSAGE_DICT = {
    "傷科治療": "B54",
    "複雜傷科": "B56",
    "一般傷科": "E02",
    "中度複雜性傷科": "E04",
    "中度複雜性傷科不分療程": "E14",
    "高度複雜性傷科": "E06",
    # "中度複雜性傷科合併特殊疾病": "F60",  # 2025-08-25 禾豐 (原為E08)
    "中度複雜性傷科合併特殊疾病": "E08",
}
DISLOCATE_DRUG_DICT = {
    "脫臼復位": "B57",
    "脫臼整復首次": "B61",
    "脫臼整復": "B62",
    "脫臼整復復位": "E09",
    "骨折復位": "E11",
}
DISLOCATE_DICT = {
    "脫臼復位": "B57",
    "脫臼整復首次": "B61",
    "脫臼整復": "B63",
    "脫臼整復復位": "E10",
    "骨折復位": "E12",
}

CARE_DICT = {
    "小兒氣喘(氣霧處置)": "C01",
    "小兒氣喘": "C02",
    "小兒腦性麻痺(藥浴處置)": "C03",
    "小兒腦性麻痺": "C04",
    "腦血管疾病": "C05",
}

TREAT_DICT = {
    **ACUPUNCTURE_DRUG_DICT,
    **ACUPUNCTURE_DICT,
    **MASSAGE_DRUG_DICT,
    **MASSAGE_DICT,
    **DISLOCATE_DRUG_DICT,
    **DISLOCATE_DICT,
    **CARE_DICT,
}

# 療程首次禁用處置代碼
TREAT_COURSE_1_EXCLUDE = {
    "F38",
    "F39",
    "F55",
    "F56",
}

# 療程2-6次禁用處置代碼
TREAT_COURSE_2_EXCLUDE = {
    "E03",
    "E04",
    "E05",
    "E06",
    "E07",
    "E08",
    "E09",
    "E10",
    "E11",
    "E12",
    "F37",
    "F54",
    "F40",
    "F43",
    "F46",
    "F49",
    "F57",
    "F60",
    "F63",
    "F66",
}

TREAT_NAME_DICT = {
    "B41": "針灸治療",
    "B42": "針灸治療",
    "B43": "電針治療",
    "B44": "電針治療",
    "B45": "複雜針灸",
    "B46": "複雜針灸",
    "B53": "傷科治療",
    "B54": "傷科治療",
    "B55": "複雜傷科",
    "B56": "複雜傷科",
    "B61": "脫臼整復首次",
    "B62": "脫臼整復",
    "B63": "脫臼整復",
    "D01": "一般針灸",
    "D02": "一般針灸",
    "P59041": "針灸(或電針)治療處置費",
    "D03": "電針",
    "D04": "電針",
    "D05": "中度複雜性針灸",
    "D06": "中度複雜性針灸",
    "D07": "高度複雜性針灸",
    "D08": "高度複雜性針灸",
    "E01": "一般傷科",
    "E02": "一般傷科",
    "P59042": "傷科(含推拿治療或外敷換藥處置)治療處置費",
    "E03": "中度複雜性傷科",
    "E04": "中度複雜性傷科",
    "E05": "高度複雜性傷科",
    "E06": "高度複雜性傷科",
    "E07": "中度複雜性傷科合併特殊疾病",
    "E08": "中度複雜性傷科合併特殊疾病",
    "E09": "脫臼整復復位",
    "E10": "脫臼整復復位",
    "E11": "骨折復位",
    "E12": "骨折復位",
    "E13": "中度複雜性傷科-不分療程開藥",
    "E14": "中度複雜性傷科-不分療程未開藥",
    "F01": "一般針灸合併一般傷科-開藥",
    "F02": "一般針灸合併一般傷科-未開藥",
    "F03": "一般針灸合併中度傷科-療程首次",
    "F04": "一般針灸合併中度傷科-療程2-6次開藥",
    "F05": "一般針灸合併中度傷科-療程2-6次未開藥",
    "F69": "一般針灸合併中度傷科-不分療程開藥",
    "F70": "一般針灸合併中度傷科-不分療程未開藥",
    "F06": "一般針灸合併高度傷科-起始次",
    "F07": "一般針灸合併高度傷科-療程2-6次開藥",
    "F08": "一般針灸合併高度傷科-療程2-6次未開藥",
    "F09": "一般針灸合併中度傷科合併特殊疾病-起始次",
    "F10": "一般針灸合併中度傷科合併特殊疾病-後續治療開藥",
    "F11": "一般針灸合併中度傷科合併特殊疾病-後續治療未開藥",
    "F12": "一般針灸合併脫臼整復復位-起始次",
    "F13": "一般針灸合併脫臼整復復位-後續治療開藥",
    "F14": "一般針灸合併脫臼整復復位-後續治療未開藥",
    "F15": "一般針灸合併骨折復位-起始次",
    "F16": "一般針灸合併骨折復位-後續治療開藥",
    "F17": "一般針灸合併骨折復位-後續治療未開藥",
    "F18": "電針合併一般傷科-開藥",
    "F19": "電針合併一般傷科-未開藥",
    "F20": "電針合併中度傷科-療程首次",
    "F21": "電針合併中度傷科-療程2-6次開藥",
    "F22": "電針合併中度傷科-療程2-6次未開藥",
    "F73": "電針合併中度傷科-不分療程開藥",
    "F74": "電針合併中度傷科-不分療程未開藥",
    "F23": "電針合併高度傷科-起始次",
    "F24": "電針合併高度傷科-療程2-6次開藥",
    "F25": "電針合併高度傷科-療程2-6次未開藥",
    "F26": "電針合併中度傷科合併特殊疾病-起始次",
    "F27": "電針合併中度傷科合併特殊疾病-後續治療開藥",
    "F28": "電針合併中度傷科合併特殊疾病-後續治療未開藥",
    "F29": "電針合併脫臼整復復位-起始次",
    "F30": "電針合併脫臼整復復位-後續治療開藥",
    "F31": "電針合併脫臼整復復位-後續治療未開藥",
    "F32": "電針合併骨折復位-起始次",
    "F33": "電針合併骨折復位-後續治療開藥",
    "F34": "電針合併骨折復位-後續治療未開藥",
    "F35": "中度針灸合併一般傷科-開藥",
    "F36": "中度針灸合併一般傷科-未開藥",
    "F37": "中度針灸合併中度傷科-療程首次",
    "F38": "中度針灸合併中度傷科-療程2-6次開藥",
    "F39": "中度針灸合併中度傷科-療程2-6次未開藥",
    "F77": "中度針灸合併中度傷科-不分療程開藥",
    "F78": "中度針灸合併中度傷科-不分療程未開藥",
    "F40": "中度針灸合併高度傷科-起始次",
    "F41": "中度針灸合併高度傷科-療程2-6次開藥",
    "F42": "中度針灸合併高度傷科-療程2-6次未開藥",
    "F43": "中度針灸合併中度傷科合併特殊疾病-起始次",
    "F44": "中度針灸合併中度傷科合併特殊疾病-後續治療開藥",
    "F45": "中度針灸合併中度傷科合併特殊疾病-後續治療未開藥",
    "F46": "中度針灸合併脫臼整復復位-起始次",
    "F47": "中度針灸合併脫臼整復復位-後續治療開藥",
    "F48": "中度針灸合併脫臼整復復位-後續治療未開藥",
    "F49": "中度針灸合併骨折復位-起始次",
    "F50": "中度針灸合併骨折復位-後續治療開藥",
    "F51": "中度針灸合併骨折復位-後續治療未開藥",
    "F52": "高度針灸合併一般傷科-開藥",
    "F53": "高度針灸合併一般傷科-未開藥",
    "F54": "高度針灸合併中度傷科-療程首次",
    "F55": "高度針灸合併中度傷科-療程2-6次開藥",
    "F56": "高度針灸合併中度傷科-療程2-6次未開藥",
    "F81": "高度針灸合併中度傷科-不分療程開藥",
    "F82": "高度針灸合併中度傷科-不分療程未開藥",
    "F57": "高度針灸合併高度傷科-起始次",
    "F58": "高度針灸合併高度傷科-療程2-6次開藥",
    "F59": "高度針灸合併高度傷科-療程2-6次未開藥",
    "F60": "高度針灸合併中度傷科合併特殊疾病-起始次",
    "F61": "高度針灸合併中度傷科合併特殊疾病-後續治療開藥",
    "F62": "高度針灸合併中度傷科合併特殊疾病-後續治療未開藥",
    "F63": "高度針灸合併脫臼整復復位-起始次",
    "F64": "高度針灸合併脫臼整復復位-後續治療開藥",
    "F65": "高度針灸合併脫臼整復復位-後續治療未開藥",
    "F66": "高度針灸合併骨折復位-起始次",
    "F67": "高度針灸合併骨折復位-後續治療開藥",
    "F68": "高度針灸合併骨折復位-後續治療未開藥",
}

AUXILIARY_TREAT_DICT = {
    "拔罐": "CH01",
    "拔罐治療": "CH01",
    "刮痧": "CH02",
    "刮痧治療": "CH02",
    "熱療": "CH03",
    "熱療 (含紅外線治療)": "CH03",
    "電療": "CH04",
    "放血": "CH05",
    "放血治療": "CH05",
    "艾灸": "CH06",
    "艾灸治療": "CH06",
    "眼部特殊針灸": "CH07",
    "藥薰": "CH08",
    "藥薰治療": "CH08",
    "膏布": "CH09",
    "膏布治療": "CH09",
    "夾板固定": "CH10",
    "夾板固定治療": "CH10",
}

POSITION_DICT = {
    "頭頸部": "CA",
    "軀幹部": "CC",
    "左上肢": "CH",
    "右上肢": "CO",
    "左下肢": "CV",
    "右下肢": "C1",
    "頭部": "CA",
    "頸部": "CB",
    "前軀幹": "CC",
    "後軀幹": "CD",
    "背部": "CE",
    "腰部": "CF",
    "股部": "CG",
    "左上肢": "CH",
    "左指": "CI",
    "左腕": "CJ",
    "左肘": "CK",
    "左上臂": "CL",
    "左下臂": "CM",
    "左肩": "CN",
    "右上肢": "CO",
    "右指": "CP",
    "右腕": "CQ",
    "右肘": "CR",
    "右上臂": "CS",
    "右下臂": "CT",
    "右肩": "CU",
    "左下肢": "CV",
    "左趾": "CW",
    "左踝": "CX",
    "左膝": "CY",
    "左大腿": "CZ",
    "左小腿": "C0",
    "右下肢": "C1",
    "右趾": "C2",
    "右踝": "C3",
    "右膝": "C4",
    "右大腿": "C5",
    "右小腿": "C6",
}

POSTION_NAME_DICT = dict(zip(POSITION_DICT.values(), POSITION_DICT.keys()))

OLD_POSITION_NAME_DICT = {
    "1A": "頭頸部",
    "2A": "頭頸部",
    "3A": "前軀幹",
    "4": "後軀幹",
    "4A": "背部",
    "4B": "腰部",
    "4C": "股部",
    "5": "左上肢",
    "5A": "左指",
    "5B": "左腕",
    "5C": "左肘",
    "5D": "左上臂",
    "5E": "左下臂",
    "5F": "左肩",
    "6": "右上肢",
    "6A": "右指",
    "6B": "右腕",
    "6C": "右肘",
    "6D": "右上臂",
    "6E": "右下臂",
    "6F": "右肩",
    "7": "左下肢",
    "7A": "左趾",
    "7B": "左踝",
    "7C": "左膝",
    "7D": "左大腿",
    "7E": "左小腿",
    "8": "右下肢",
    "8A": "右趾",
    "8B": "右踝",
    "8C": "右膝",
    "8D": "右大腿",
    "8E": "右小腿",
}

FREQUENCY = {
    1: "QD",
    2: "BID",
    3: "TID",
    4: "QID",
    5: "PID",
    6: "Q4H",
    7: "Q4H",
    8: "Q3H",
}

USAGE = {
    "飯前": "AC",
    "飯後": "PC",
    "飯後睡前": "PC",
}

CHARGE_TYPE = ["診察費", "藥費", "調劑費", "處置費", "檢驗費", "照護費"]
COURSE_TYPE = ["首次", "療程"]
ABNORMAL_CARD_WITH_HINT = [
    "HVIT 法定傳染病通報隔離",
    "A010 讀卡機故障",
    "A020 網路故障",
    "A030 安全模組故障",
    "B000 健保卡讀取不良",
    "C000 停電",
    "C001 例外就醫",
    "C002 18歲以下兒少",
    "C003 弱勢民眾就醫",
    "D000 醫療軟體當機",
    "D010 醫療電腦當機",
    "E000 健保署系統當機",
    "E001 控卡名單已簽切結書",
    "F000 巡迴醫療無法上網",
    "F00B 居家醫療離線認卡",
    "G000 新特約醫事機構",
    "Z000 其他",
    "H000 高齡醫師",
]

TOUR_AREA_LEVEL = {
    "資源不足": [
        "新北市石碇區",
        "新北市坪林區",
        "新北市石門區",
        "新北市平溪區",
        "新北市雙溪區",
        "新北市貢寮區",
        "新北市萬里區",
        "宜蘭縣冬山鄉",
        "宜蘭縣五結鄉",
        "宜蘭縣三星鄉",
        "桃園市觀音區",
        "新竹縣新埔鎮",
        "新竹縣橫山鎮",
        "新竹縣芎林鄉",
        "新竹縣寶山鄉",
        "新竹縣北埔鄉",
        "新竹縣峨嵋鄉",
        "苗栗縣南庄鄉",
        "苗栗縣西湖鄉",
        "苗栗縣造橋鄉",
        "苗栗縣三灣鄉",
        "苗栗縣獅壇鄉",
        "台中市大安區",
        "彰化縣線西鄉",
        "彰化縣福興鄉",
        "彰化縣芬園鄉",
        "彰化縣埔鹽鄉",
        "彰化縣田尾鄉",
        "彰化縣芳苑鄉",
        "彰化縣溪州鄉",
        "南投縣鹿谷鄉",
        "南投縣中寮鄉",
        "南投縣魚池鄉",
        "南投縣國姓鄉",
        "雲林縣大埤鄉",
        "雲林縣台西鄉",
        "雲林縣元長鄉",
        "嘉義縣六腳鄉",
        "嘉義縣東石鄉",
        "嘉義縣鹿草鄉",
        "嘉義縣番路鄉",
        "嘉義縣大埔鄉",
        "台南市大內區",
        "台南市七股區",
        "台南市將軍區",
        "台南市北門區",
        "台南市楠西區",
        "台南市南化區",
        "台南市左鎮區",
        "台南市龍崎區",
        "高雄市田寮區",
        "高雄市永安區",
        "高雄市六龜區",
        "高雄市甲仙區",
        "高雄市杉林區",
        "高雄市內門區",
        "屏東縣萬巒鄉",
        "屏東縣竹田鄉",
        "屏東縣崁頂鄉",
        "屏東縣車城鄉",
        "屏東縣滿州鄉",
        "屏東縣枋山鄉",
        "花蓮縣鳳林鎮",
        "花蓮縣玉里鎮",
        "花蓮縣壽豐鄉",
        "花蓮縣光復鄉",
        "花蓮縣豐濱鄉",
        "花蓮縣瑞穗鄉",
        "花蓮縣富里鄉",
        "台東縣成功鎮",
        "台東縣卑南鄉",
        "台東縣大武鄉",
        "台東縣太麻里鄉",
        "台東縣東河鄉",
        "台東縣長濱鄉",
        "台東縣鹿野鄉",
        "台東縣池上鄉",
    ],
    "一級偏遠": [
        "新北市坪林區",
        "新北市石門區",
        "新北市平溪區",
        "新北市雙溪區",
        "宜蘭縣冬山鄉",
        "宜蘭縣壯圍鄉",
        "新竹縣橫山鄉",
        "新竹縣寶山鄉",
        "新竹縣北埔鄉",
        "新竹縣峨嵋鄉",
        "苗栗縣南庄鄉",
        "苗栗縣頭屋鄉",
        "苗栗縣西湖鄉",
        "苗栗縣獅潭鄉",
        "台中市大安區",
        "彰化縣大城鄉",
        "雲林縣東勢鄉",
        "嘉義縣布袋鎮",
        "嘉義縣溪口鄉",
        "嘉義縣鹿草鄉",
        "嘉義縣番路鄉",
        "台南市後壁區",
        "台南市大內區",
        "台南市左鎮區",
        "台南市龍崎區",
        "台南市北門區",
        "台南市東山區",
        "台南市安定區",
        "高雄市田寮區",
        "屏東縣萬巒鄉",
        "屏東縣竹田鄉",
        "屏東縣新埤鄉",
        "屏東縣崁頂鄉",
        "屏東縣車城鄉",
        "屏東縣枋山鄉",
        "花蓮縣富里鄉",
        "台東縣東河鄉",
        "台東縣鹿野鄉",
    ],
    "二級偏遠": [
        "花蓮縣豐濱鄉",
        "台東縣大武鄉",
        "台東縣長濱鄉",
    ],
    "山地鄉": [
        "新北市烏來區",
        "宜蘭縣大同鄉",
        "宜蘭縣南澳鄉",
        "桃園市復興區",
        "新竹縣尖石鄉",
        "新竹縣五峰鄉",
        "苗栗縣泰安鄉",
        "台中市和平區",
        "南投縣信義鄉",
        "南投縣仁愛鄉",
        "嘉義縣阿里山鄉",
        "高雄市茂林區",
        "高雄市桃源區",
        "高雄市那瑪夏區",
        "屏東縣山地門鄉",
        "屏東縣霧臺鄉",
        "屏東縣泰武鄉",
        "屏東縣來義鄉",
        "屏東縣春日鄉",
        "屏東縣獅子鄉",
        "屏東縣牡丹鄉",
        "屏東縣瑪家鄉",
        "花蓮縣秀林鄉",
        "花蓮縣萬榮鄉",
        "花蓮縣卓溪鄉",
        "台東縣延平鄉",
        "台東縣海端鄉",
        "台東縣達仁鄉",
        "台東縣金峰鄉",
    ],
    "一級離島": [
        "屏東縣琉球鄉",
        "連江縣南竿鄉",
        "連江縣北竿鄉",
    ],
    "二級離島": [
        "澎湖縣白沙鄉",
        "澎湖縣西嶼鄉",
        "台東縣綠島鄉",
    ],
    "三級離島": [
        "澎湖縣吉貝村",
        "澎湖縣望安鄉",
        "澎湖縣七美鄉",
        "台東縣蘭嶼鄉",
        "金門縣烈嶼鄉",
        "金門縣烏坵鄉",
        "連江縣莒光鄉",
        "連江縣東引鄉",
    ],
}

TOUR_AREA_CODE = {
    "桃園市觀音區": "3212",
    "桃園市復興區": "3213",
}

TOUR_AREA_DICT = {
    "-- 資源不足 --": None,
    "新北市三芝區": 0,
    "新北市金山區": 0,
    "新北市萬里區": 0,
    "新北市貢寮區": 0,
    "新北市石碇區": 0,
    "新北市八里區": 0,
    "宜蘭縣冬山鄉": 0,
    "宜蘭縣五結鄉": 0,
    "宜蘭縣三星鄉": 0,
    "桃園市觀音區": 0,
    "新竹縣新埔鎮": 0,
    "新竹縣橫山鎮": 0,
    "新竹縣芎林鄉": 0,
    "新竹縣寶山鄉": 0,
    "新竹縣北埔鄉": 0,
    "新竹縣峨嵋鄉": 0,
    "苗栗縣南庄鄉": 0,
    "苗栗縣西湖鄉": 0,
    "苗栗縣造橋鄉": 0,
    "苗栗縣三灣鄉": 0,
    "苗栗縣獅壇鄉": 0,
    "台中市大安區": 0,
    "彰化縣線西鄉": 0,
    "彰化縣福興鄉": 0,
    "彰化縣芬園鄉": 0,
    "彰化縣埔鹽鄉": 0,
    "彰化縣田尾鄉": 0,
    "彰化縣芳苑鄉": 0,
    "彰化縣溪州鄉": 0,
    "南投縣鹿谷鄉": 0,
    "南投縣中寮鄉": 0,
    "南投縣魚池鄉": 0,
    "南投縣國姓鄉": 0,
    "雲林縣大埤鄉": 0,
    "雲林縣台西鄉": 0,
    "雲林縣元長鄉": 0,
    "嘉義縣六腳鄉": 0,
    "嘉義縣東石鄉": 0,
    "嘉義縣鹿草鄉": 0,
    "嘉義縣番路鄉": 0,
    "嘉義縣大埔鄉": 0,
    "台南市大內區": 0,
    "台南市七股區": 0,
    "台南市將軍區": 0,
    "台南市北門區": 0,
    "台南市楠西區": 0,
    "台南市南化區": 0,
    "台南市左鎮區": 0,
    "台南市龍崎區": 0,
    "高雄市田寮區": 0,
    "高雄市永安區": 0,
    "高雄市六龜區": 0,
    "高雄市甲仙區": 0,
    "高雄市杉林區": 0,
    "高雄市內門區": 0,
    "屏東縣萬巒鄉": 0,
    "屏東縣竹田鄉": 0,
    "屏東縣崁頂鄉": 0,
    "屏東縣車城鄉": 0,
    "屏東縣滿州鄉": 0,
    "屏東縣枋山鄉": 0,
    "花蓮縣鳳林鎮": 0,
    "花蓮縣玉里鎮": 0,
    "花蓮縣壽豐鄉": 0,
    "花蓮縣光復鄉": 0,
    "花蓮縣豐濱鄉": 0,
    "花蓮縣瑞穗鄉": 0,
    "花蓮縣富里鄉": 0,
    "台東縣成功鎮": 0,
    "台東縣卑南鄉": 0,
    "台東縣大武鄉": 0,
    "台東縣太麻里鄉": 0,
    "台東縣東河鄉": 0,
    "台東縣長濱鄉": 0,
    "台東縣鹿野鄉": 0,
    "台東縣池上鄉": 0,
    "-- 一級偏遠 --": None,
    "新北市坪林區": 1,
    "新北市石門區": 1,
    "新北市平溪區": 1,
    "新北市雙溪區": 1,
    "宜蘭縣冬山鄉": 1,
    "宜蘭縣壯圍鄉": 1,
    "新竹縣橫山鄉": 1,
    "新竹縣寶山鄉": 1,
    "新竹縣北埔鄉": 1,
    "新竹縣峨嵋鄉": 1,
    "苗栗縣南庄鄉": 1,
    "苗栗縣頭屋鄉": 1,
    "苗栗縣西湖鄉": 1,
    "苗栗縣獅潭鄉": 1,
    "台中市大安區": 1,
    "彰化縣大城鄉": 1,
    "雲林縣東勢鄉": 1,
    "嘉義縣布袋鎮": 1,
    "嘉義縣溪口鄉": 1,
    "嘉義縣鹿草鄉": 1,
    "嘉義縣番路鄉": 1,
    "台南市後壁區": 1,
    "台南市大內區": 1,
    "台南市左鎮區": 1,
    "台南市龍崎區": 1,
    "台南市北門區": 1,
    "台南市東山區": 1,
    "台南市安定區": 1,
    "高雄市田寮區": 1,
    "屏東縣萬巒鄉": 1,
    "屏東縣竹田鄉": 1,
    "屏東縣新埤鄉": 1,
    "屏東縣崁頂鄉": 1,
    "屏東縣車城鄉": 1,
    "屏東縣枋山鄉": 1,
    "花蓮縣富里鄉": 1,
    "台東縣東河鄉": 1,
    "台東縣鹿野鄉": 1,
    "-- 二級偏遠 --": None,
    "花蓮縣豐濱鄉": 2,
    "台東縣大武鄉": 2,
    "台東縣長濱鄉": 2,
    "-- 山地鄉 --": None,
    "新北市烏來區": 3,
    "宜蘭縣大同鄉": 3,
    "宜蘭縣南澳鄉": 3,
    "桃園市復興區": 3,
    "新竹縣尖石鄉": 3,
    "新竹縣五峰鄉": 3,
    "苗栗縣泰安鄉": 3,
    "台中市和平區": 3,
    "南投縣信義鄉": 3,
    "南投縣仁愛鄉": 3,
    "嘉義縣阿里山鄉": 3,
    "高雄市茂林區": 3,
    "高雄市桃源區": 3,
    "高雄市那瑪夏區": 3,
    "屏東縣山地門鄉": 3,
    "屏東縣霧臺鄉": 3,
    "屏東縣泰武鄉": 3,
    "屏東縣來義鄉": 3,
    "屏東縣春日鄉": 3,
    "屏東縣獅子鄉": 3,
    "屏東縣牡丹鄉": 3,
    "屏東縣瑪家鄉": 3,
    "花蓮縣秀林鄉": 3,
    "花蓮縣萬榮鄉": 3,
    "花蓮縣卓溪鄉": 3,
    "台東縣延平鄉": 3,
    "台東縣海端鄉": 3,
    "台東縣達仁鄉": 3,
    "台東縣金峰鄉": 3,
    "-- 一級離島 --": None,
    "屏東縣琉球鄉": 4,
    "連江縣南竿鄉": 4,
    "連江縣北竿鄉": 4,
    "-- 二級離島 --": None,
    "澎湖縣白沙鄉": 5,
    "澎湖縣西嶼鄉": 5,
    "台東縣綠島鄉": 5,
    "-- 三級離島 --": None,
    "澎湖縣吉貝村": 6,
    "澎湖縣望安鄉": 6,
    "澎湖縣七美鄉": 6,
    "台東縣蘭嶼鄉": 6,
    "金門縣烈嶼鄉": 6,
    "金門縣烏坵鄉": 6,
    "連江縣莒光鄉": 6,
    "連江縣東引鄉": 6,
}

TOUR_INS_CODE_DICT = {
    0: "P23064",
    1: "P23007",
    2: "P23063",
    3: "P23008",
    4: "P23009",
    5: "P23010",
    6: "P23011",
}

TOUR_INS_FEE_DICT = {
    "P23064": 2300,
    "P23007": 3300,
    "P23063": 5300,
    "P23008": 9800,
    "P23009": 12000,
    "P23010": 13100,
    "P23011": 14200,
}

CORRECTION_AREA_DICT = {
    "台北業務組": {
        "宜蘭監獄": "9A34101091",
        "基隆監獄": "9A11070017",
        "基隆看守所": "9A11070026",
        "金門監獄": "9A90030031",
        "台北看守所": "9A31130232",
        "台北女子看守所": "9A31130014",
        "台北少年觀護所": "9A31130223",
        "新店戒治所": "9A31050544",
    },
    "北區業務組": {
        "臺北監獄(不含桃園分監)": "9A32071634",
        "臺北監獄桃園分監": "9A32010039",
        "桃園監獄": "9A32011987",
        "敦品中學": "9A32011503",
        "桃園女子監獄": "9A32090046",
        "八德外役監獄": "9A32080022",
        "新竹監獄": "9A12041201",
        "誠正中學": "9A33080013",
        "新竹看守所": "9A12040106",
        "苗栗看守所": "9A35011336",
    },
    "中區業務組": {
        "臺中監獄(含外役分監)": "9A17070017",
        "臺中女子監獄": "9A17070168",
        "臺中看守所": "9A17071218",
        "臺中戒治所": "9A17071033",
        "南投看守所": "9A38010260",
        "勵志中學": "9A37070075",
        "彰化監獄": "9A37080019",
        "彰化看守所": "9A37051221",
    },
    "南區業務組": {
        "雲林監獄": "9A39030013",
        "雲林第二監獄": "9A39031245",
        "嘉義監獄": "9A40100526",
        "嘉義看守所": "9A40100091",
        "臺南監獄(不含明德戒治分監) ": "9A41281175",
        "臺南少年觀護所": "9A21020167",
        "臺南看守所": "9A41281095",
        "明德外役監獄": "9A05220010",
        "臺南監獄明德戒治分監": "9A05220029",
        "臺南第二監獄": "9A05130020",
    },
    "高屏業務組": {
        "高雄監獄": "9A42060014",
        "高雄女子監獄": "9A42061266",
        "高雄第二監獄": "9A42121249",
        "明陽中學": "9A42120117",
        "高雄戒治所": "9A42120511",
        "屏東監獄": "9A43140042",
        "屏東看守所": "9A43140011",
        "澎湖監獄": "9A44020015",
    },
    "東區業務組": {
        "花蓮監獄": "9A45050176",
        "自強外役監獄": "9A45071139",
        "花蓮看守所": "9A45011606",
        "臺東戒治所": "9A46091073",
        "臺東監獄": "9A46011468",
        "岩灣技能訓練所": "9A46010372",
        "東成技能訓練所": "9A46040076",
        "綠島監獄": "9A46110073",
        "泰源技能訓練所": "9A46070092",
    },
}

INVALID_INS_CODE_LIST = [
    "A005541",
    "A014478",
    "A015127",
    "A033317",
    "A035340",
    "A038028",
    "A039447",
    "A031916",
    "A033818",
    "A033842",
    "A033843",
    "A038582",
    "A038742",
    "A039933",
    "A040942",
    "A008178",
]


# 復旦製藥 79 項回收藥品代碼單獨清單
INVALID_FUDAN_INS_CODE_LIST = [
    "A006060",
    "A006061",
    "A006116",
    "A006117",
    "A006119",
    "A006668",
    "A006672",
    "A006708",
    "A006709",
    "A006712",
    "A006714",
    "A006715",
    "A006717",
    "A006718",
    "A007104",
    "A007109",
    "A007304",
    "A007309",
    "A007845",
    "A007853",
    "A007856",
    "A007871",
    "A008337",
    "A008340",
    "A008341",
    "A008660",
    "A009533",
    "A009543",
    "A009829",
    "A009831",
    "A009844",
    "A024340",
    "A024428",
    "A025267",
    "A025298",
    "A025299",
    "A025496",
    "A025508",
    "A025599",
    "A025752",
    "A026623",
    "A026987",
    "A028931",
    "A029178",
    "A031417",
    "A031418",
    "A031422",
    "A031423",
    "A032103",
    "A032545",
    "A032604",
    "A036778",
    "A037100",
    "A038254",
    "A038743",
    "A038744",
    "A039197",
    "A039243",
    "A039245",
    "A039425",
    "A039428",
    "A039533",
    "A039534",
    "A039888",
    "A039892",
    "A042285",
    "A042286",
    "A042291",
    "A044229",
    "A044584",
    "A044705",
    "A045882",
    "A045947",
    "A045986",
    "A046098",
    "A047120",
    "A047160",
    "A047544",
    "A052601",
]

# 2026-01-27 萬國信宏無效健保碼
# INVALID_WKP_INS_CODE_LIST = [
#     "A037169", "A037175", "A037418", "A037419", "A037422",
#     "A037430", "A037437", "A037439", "A037495", "A037818",
#     "A037915", "A037941", "A038036", "A038043", "A038067",
#     "A038071", "A038532", "A038534", "A038551", "A039150",
#     "A039287", "A039296", "A039436", "A039697", "A040901",
#     "A041216", "A041610", "A042155", "A042313", "A042331",
#     "A042409", "A042481", "A042489", "A043199", "A043370",
#     "A044106", "A044110", "A044794", "A044837", "A045106"
# ]
# 建議補充後的清單 (新增 A056946, A056947, A056892, A057118, A058863)
INVALID_WKP_INS_CODE_LIST = [
    "A037169",
    "A037175",
    "A037418",
    "A037419",
    "A037422",
    "A037430",
    "A037437",
    "A037439",
    "A037495",
    "A037818",
    "A037915",
    "A037941",
    "A038036",
    "A038043",
    "A038067",
    "A038071",
    "A038532",
    "A038534",
    "A038551",
    "A039150",
    "A039287",
    "A039296",
    "A039436",
    "A039697",
    "A040901",
    "A041216",
    "A041610",
    "A042155",
    "A042313",
    "A042331",
    "A042409",
    "A042481",
    "A042489",
    "A043199",
    "A043370",
    "A044106",
    "A044110",
    "A044794",
    "A044837",
    "A045106",
    "A056946",
    "A056947",
    "A056892",
    "A057118",
    "A058863",
    "A040006",  # 2026-03-23
    "A040014",
    "A041218",
    "A046512",
]


ABNORMAL_CARD = [
    ABNORMAL_CARD_WITH_HINT[i].split(" ")[0]
    for i in range(len(ABNORMAL_CARD_WITH_HINT))
]
ABNORMAL_CARD_DICT = {
    ABNORMAL_CARD_WITH_HINT[i].split(" ")[0]: ABNORMAL_CARD_WITH_HINT[i]
    for i in range(len(ABNORMAL_CARD_WITH_HINT))
}

MANUAL_CARD_LIST = ABNORMAL_CARD + [OCCUPATIONAL_INJURY_CARD]

INJURY_CARD_WITH_HINT = [
    "IC06 職業傷害",
]
INJURY_CARD = [
    INJURY_CARD_WITH_HINT[i].split(" ")[0] for i in range(len(INJURY_CARD_WITH_HINT))
]
INJURY_CARD_DICT = {
    INJURY_CARD_WITH_HINT[i].split(" ")[0]: INJURY_CARD_WITH_HINT[i]
    for i in range(len(INJURY_CARD_WITH_HINT))
}

INFECTIOUS_CARD_WITH_HINT = [
    "HVIT 法定傳染病通報隔離",
]
INFECTIOUS_CARD = [
    INFECTIOUS_CARD_WITH_HINT[i].split(" ")[0]
    for i in range(len(INFECTIOUS_CARD_WITH_HINT))
]
INFECTIOUS_CARD_DICT = {
    INFECTIOUS_CARD_WITH_HINT[i].split(" ")[0]: INFECTIOUS_CARD_WITH_HINT[i]
    for i in range(len(INFECTIOUS_CARD_WITH_HINT))
}

CARD = (
    ["自動取得", "IC", "免卡", "欠卡"] + INJURY_CARD_WITH_HINT + ABNORMAL_CARD_WITH_HINT
)
UPLOAD_TYPE = ["1-正常上傳", "2-異常上傳", "3-正常補正", "4-異常補正"]
TREAT_AFTER_CHECK = ["1-正常", "2-補卡"]

COURSE = ["1", "2", "3", "4", "5", "6"]
ROOM = [
    "1",
    "2",
    "3",
    "5",
    "6",
    "7",
    "8",
    "9",
    "10",
    "11",
    "12",
    "13",
    "15",
    "16",
    "17",
    "18",
    "19",
    "20",
]
PERIOD = ["早班", "午班", "晚班"]
INS_MEDICINE_TYPE = ["單方", "複方"]
POSITION = [
    "醫師",
    "支援醫師",
    "藥師",
    "護理師",
    "護士",
    "助理",
    "職員",
    "推拿師父",
    "物理治療師",
    "其他",
    "已離職",
]
FULLTIME = ["全職", "兼職", "已離職"]
GENDER = ["男", "女"]
BLOOD_TYPE = [None, "A", "B", "AB", "O", "RH+", "RH-"]
NATIONALITY = ["本國", "外國", "居留證", "遊民"]
MARRIAGE = ["未婚", "已婚", "單身"]
EDUCATION = ["國小", "國中", "高中", "專科", "大學", "碩士", "博士", "其他"]
OCCUPATION = ["工", "商", "農漁業", "軍公教", "自由業", "服務業", "其他"]
# DISCOUNT = ['員工', '眷屬', '親友', '殘障', '僧侶', '教友', '老人', '榮民', '福保']
DISCOUNT = []
DIVISION = [
    "台北業務組",
    "北區業務組",
    "中區業務組",
    "南區業務組",
    "高屏業務組",
    "東區業務組",
]
PACKAGE = ["1", "2", "3", "4", "5", "6"]
PRESDAYS = ["1", "2", "3", "4", "5", "6", "7", "8", "10", "14", "21", "28", "30"]
SELF_PRESDAYS = ["1", "2", "3", "4", "5", "6", "7", "8", "10", "14", "21", "28", "30"]
INSTRUCTION = ["飯前", "飯後", "飯後睡前"]
VALUATION = ["正常計價", "不計價", "單日計價", "單複方不計價", "重新計價"]
ISOLATION_POSITION = ["居家", "防疫旅館", "醫院", "集檢所"]
PAYMENT_TYPE = [
    "現金",
    "信用卡",
    "轉帳匯款",
    "Apple Pay",
    "Google Pay",
    "Samsung Pay",
    "LINE Pay",
    "台灣 Pay",
    "悠遊付",
]

nhi_eii_api_error_code = {
    500: "申請檔案作業種類(sTypeCode)錯誤",
    5000: "網路環境載入異常",
    5001: "檔案權限不足或檔案大小異常",
    5002: "找不到Reader.dll",
    5003: "檔名錯誤",
    5004: "系統忙碌中，請稍後再試",
    5005: "產生簽章錯誤",
    5006: "記憶體不足",
    5007: "下載路徑不存在",
    5008: "取得醫療院所代碼錯誤",
    5009: "檔名有誤",
    5010: "認證錯誤",
    9999: "不明異常",
    5020: "連線總數量已超過，請稍後再試。",
    5021: "網路作業錯誤，訊息不完整",
    5022: "等待醫療系統處理中",
    5023: "等待EIIAPI處理中或交易不存在",
    5024: "無法建立檔案",
    5025: "寫入磁碟異常",
    5026: "解密錯誤",
    5027: "網路作業錯誤但已完成",
    5028: "連線錯誤",
    8203: "上傳下載請求檔未成功連線至伺服器",
    8218: "回饋資料下載未成功連線至伺服器",
}


# 取得資料路徑
def get_dir(system_settings, dir_type):
    base_dir = system_settings.field("資料路徑")
    if base_dir in ["", None]:
        base_dir = os.getcwd()
        system_utils.show_message_box(
            QMessageBox.Warning,
            "尚未設定資料路徑",
            f'<font size="5" color="red"><b>資料路徑尚未設定, 使用預設的資料路徑<br>{base_dir}.</b></font>',
            "請至系統設定->其他->設定申報及備份路徑.",
        )

    if not os.path.exists(base_dir):
        try:
            os.mkdir(base_dir)
        except Exception:
            pass

    dir_dict = {
        "申報路徑": f"{base_dir}/nhi_upload",
        "備份路徑": f"{base_dir}/auto_backup",
        "異地備份路徑": base_dir,
    }

    directory = dir_dict[dir_type]

    if not os.path.exists(directory):
        try:
            os.mkdir(directory)
        except FileNotFoundError:
            system_utils.show_message_box(
                QMessageBox.Warning,
                "資料路徑錯誤",
                f'<font size="5" color="red"><b>資料路徑<b>{base_dir}</b>不存在, 請至系統設定確認正確的資料路徑.</font>',
                "請至系統設定->其他->設定申報及備份路徑.",
            )
            return None

    return directory


# 取得負擔類別
def get_share_type(share_type):
    if share_type == "健保":
        share_type = "基層醫療"

    return share_type


# 取得就醫類別
def get_treat_type(treatment):
    treat_type = "內科"
    if treatment in ACUPUNCTURE_TREAT:
        treat_type = "針灸治療"
    elif treatment in MASSAGE_TREAT:
        treat_type = "傷科治療"

    return treat_type


# 取得療程類別
def get_course_type(course):
    if 2 <= number_utils.get_integer(course) <= 6:
        course_type = "療程"
    else:
        course_type = "首次"

    return course_type


# 取得藥品類別
def get_medicine_type(database, medicine_type):
    sql = f'''
        SELECT * FROM dict_groups
        WHERE
            DictGroupsType = "{medicine_type}"''
    '''
    rows = database.select_record(sql)
    medicine_groups = []
    for row in rows:
        groups_name = row["DictGroupsName"]
        if groups_name is None:
            continue

        if medicine_type == "藥品類別" and string_utils.xstr(groups_name) in [
            "穴道",
            "處置",
            "外用",
        ]:  # 過濾自訂處方類別有與針傷處方類別相同的類別
            continue

        medicine_groups.append(row["DictGroupsName"])

    if medicine_type == "藥品類別":  # 增加處方備註
        if "備註" not in medicine_groups:
            medicine_groups.append("備註")
    elif medicine_type == "處置類別":  # 增加
        if "外用" not in medicine_groups:
            medicine_groups.append("外用")

    return medicine_groups


def get_treat_code(database, case_key):
    sql = f"""
        SELECT * FROM dosage
        WHERE
            CaseKey = {case_key}
    """
    rows = database.select_record(sql)

    dosage_row = rows[0] if len(rows) > 0 else None
    if dosage_row is not None:
        pres_days = number_utils.get_integer(dosage_row["Days"])
    else:
        pres_days = 0

    sql = f"""
        SELECT RegistType, TreatType, Treatment, Continuance FROM cases
        WHERE
            CaseKey = {case_key}
    """
    row = database.select_record(sql)[0]
    treat_type = string_utils.xstr(row["TreatType"])
    treatment = string_utils.xstr(row["Treatment"])

    treat_code = None

    if treatment in ACUPUNCTURE_TREAT:
        if treatment in MERGE_TREAT and "合併中度傷科" in treatment:
            if string_utils.xstr(row["RegistType"]) in LONG_TERM_CARE + TOUR_TYPE:
                treatment += "不分療程"
            elif number_utils.get_integer(row["Continuance"]) >= 2:  # 起始次可不用處理
                if "中度傷科" in treatment:
                    treatment += "療程2-6次"
                elif "高度傷科" in treatment:
                    treatment += "後續治療"

                if pres_days > 0:
                    treatment += "開藥"
                else:
                    treatment += "未開藥"

        if pres_days > 0:
            treat_code = ACUPUNCTURE_DRUG_DICT[treatment]
        else:
            treat_code = ACUPUNCTURE_DICT[treatment]
    elif treatment in MASSAGE_TREAT:
        if (
            string_utils.xstr(row["RegistType"]) in LONG_TERM_CARE + TOUR_TYPE
            and "中度" in treatment
        ):
            treatment += "不分療程"

        if pres_days > 0:
            treat_code = MASSAGE_DRUG_DICT[treatment]
        else:
            treat_code = MASSAGE_DICT[treatment]
    elif treatment in DISLOCATE_TREAT:
        if pres_days > 0:
            treat_code = DISLOCATE_DRUG_DICT[treatment]
        else:
            treat_code = DISLOCATE_DICT[treatment]
    elif treatment in MERGE_TREAT_LIST:
        if pres_days > 0:
            treat_code = ACUPUNCTURE_DRUG_DICT[treatment]
        else:
            treat_code = ACUPUNCTURE_DICT[treatment]
    elif treatment in CARE_TREAT:
        treat_code = CARE_DICT[treatment]

    if treat_type in ["癌症中醫門診延長照護"]:
        if treatment in GENERAL_ACUPUNCTURE_TREAT:
            treat_code = "P59041"
        elif treatment in GENERAL_MASSAGE_TREAT:
            treat_code = "P59042"

    return treat_code


def get_case_type(database, system_settings, row, diag_fee, ins_total_fee):
    injury = string_utils.xstr(row["Injury"])
    treat_type = string_utils.xstr(row["TreatType"])
    course = number_utils.get_integer(row["Continuance"])
    special_code = string_utils.xstr(row["SpecialCode"])
    regist_type = string_utils.xstr(row["RegistType"])
    treatment = string_utils.xstr(row["Treatment"])
    pres_days = case_utils.get_pres_days(database, row["CaseKey"])
    resource = system_settings.field("資源類別")

    if injury in INFECTIOUS_INJURY_TYPE:  # 法定傳染病通報隔離案件
        case_type = "C5"
    elif (
        treat_type in IMPROVE_CARE_TREAT or regist_type in LONG_TERM_CARE
    ):  # 加強照護, 照護機構中醫照護
        case_type = "22"
    elif treat_type in AUXILIARY_CARE_TREAT:  # 輔助照護
        case_type = "30"
    # elif treat_type in HOME_CARE and regist_type not in TOUR_TYPE:  # 非山地離島居家醫療
    elif treat_type in HOME_CARE:  # 非山地離島居家醫療
        case_type = "31"
    elif injury in OCCUPATIONAL_INJURY_TYPE:  # 職業傷害及職業病
        case_type = "B6"
    elif (
        regist_type in TOUR_TYPE
        or regist_type == "資源不足開業"
        or resource == "資源不足開業"
    ):  # 巡迴醫療
        case_type = "25"
    elif course >= 1 and treatment in INS_TREAT:  # 一般針傷脫臼處置
        case_type = "29"
    elif course == 0 and pres_days > 7:
        if special_code != "":  # 慢性病專案
            case_type = "24"
        else:
            case_type = (
                "24"  # 非慢性病開藥超過7日: 其他專案 / 2021.04.28 原本是22, 改回24
            )
    else:
        if diag_fee == ins_total_fee:  # 問診, 要歸類為22專案
            case_type = "22"
        else:
            case_type = "21"  # 預設為21

    return case_type


# 取得部份負擔代號 新版 2022.09.09
def get_share_code(
    database,
    start_date,
    share_type,
    treatment,
    course,
    drug_fee,
    diag_share_fee,
    drug_share_fee,
    case_row=None,
):
    share_code = get_diag_share_code(
        database, share_type, treatment, course, drug_fee, case_row
    )

    if start_date.year < 2023 or (
        start_date.year == 2023 and start_date.month < 7
    ):  # 112.07 以前沿用舊制
        return share_code

    final_share_code = get_final_share_code(share_code, diag_share_fee, drug_share_fee)

    return final_share_code


def get_final_share_code(share_code, diag_share_fee, drug_share_fee):
    if share_code in ["S10", "S14", "S20", "S24"]:
        if diag_share_fee == 50 and drug_share_fee == 0:
            share_code = "S10"
        elif diag_share_fee == 0 and drug_share_fee > 0:
            share_code = "S14"
        elif diag_share_fee > 0 and drug_share_fee == 0:
            share_code = "S20"
        elif diag_share_fee > 0 and drug_share_fee > 0:
            share_code = "S24"

    return share_code


# 取得門診負擔 (treat_type 取代 treatment的原因: 掛號時須取得門診負擔, 以treat_type代表)
def get_diag_share_code(
    database, share_type, treatment, course, drug_fee, case_row=None
):
    if share_type == "中低收入戶":
        share_type = "基層醫療"

    diag_share_code = ""
    course_type = get_course_type(course)

    if treatment in ACUPUNCTURE_TREAT:
        treatment = "針灸治療"
    elif treatment in ACUPUNCTURE_MERGE_TREAT:
        treatment = "針灸治療"
    elif treatment in MASSAGE_TREAT:
        treatment = "傷科治療"
    else:
        treatment = "內科"

    sql = f'''
        SELECT * FROM charge_settings
        WHERE
            ChargeType = "門診負擔" AND
            ShareType = "{share_type}" AND
            TreatType = "{treatment}" AND
            Course = "{course_type}"
    '''
    try:
        row = database.select_record(sql)[0]
    except IndexError:
        return diag_share_code

    if len(row) > 0:
        diag_share_code = string_utils.xstr(row["InsCode"])

    if case_row is not None:
        if number_utils.get_integer(case_row["DrugShareFee"]) > 0:
            diag_share_code = "S20"
        elif number_utils.get_integer(case_row["DiagShareFee"]) > 0 and course >= 2:
            diag_share_code = "S20"

        if diag_share_code == "S10" and case_row["RegistType"] in TOUR_TYPE:
            diag_share_code = "S20"

    treat_type = string_utils.xstr(case_row["TreatType"])
    regist_type = string_utils.xstr(case_row["RegistType"])

    # 非山地離島居家醫療部份負擔 S10, S20 --> K10, K20
    if (
        treat_type in HOME_CARE
        and regist_type not in TOUR_TYPE
        and share_type in ["基層醫療"]
    ):
        if drug_fee > 0:  # 開藥
            diag_share_code = "K20"
        else:
            diag_share_code = "K00"

    return diag_share_code


# 取得專案代碼
def get_special_code(database, system_settings, case_key):
    special_code_list = []
    sql = f"""
        SELECT RegistType, Injury, TreatType, Treatment, SpecialCode FROM cases
        WHERE
            CaseKey = {case_key}
    """
    row = database.select_record(sql)[0]
    regist_type = string_utils.xstr(row["RegistType"])
    injury = string_utils.xstr(row["Injury"])
    treat_type = string_utils.xstr(row["TreatType"])
    treatment = string_utils.xstr(row["Treatment"])
    special_code = string_utils.xstr(row["SpecialCode"])
    # 先檢查特定照護
    if treat_type in AUXILIARY_CARE_TREAT:  # 腦血管疾病
        return [None, None, None, None]

    if treat_type in IMPROVE_CARE_TREAT:
        special_code_list.append(SPECIAL_CODE_DICT[treat_type])
        special_code_list = special_code_list + [None] * (4 - len(special_code_list))
        return special_code_list

    if injury in OCCUPATIONAL_INJURY_TYPE:  # 職業傷害及職業病 排除
        pass
    elif system_settings.field("資源類別") == "資源不足開業":
        special_code_list.append("C7")
    elif regist_type in TOUR_TYPE:
        if treat_type in HOME_CARE:  # 山地離島居家醫療
            special_code_list.append(SPECIAL_CODE_DICT[treat_type])
        else:
            special_code_list.append("C6")
    elif treat_type in HOME_CARE:
        special_code_list.append(SPECIAL_CODE_DICT[treat_type])
    elif regist_type in SPECIAL_PHARMACY_TYPE + LONG_TERM_CARE:
        special_code_list.append(SPECIAL_CODE_DICT[regist_type])
    elif regist_type in CORRECTION_REG_TYPE:
        special_code_list.append(SPECIAL_CODE_DICT[regist_type])

    if special_code != "":
        special_code_list.append(special_code)

    if treatment in ACUPUNCTURE_TREAT:
        special_code_list.append("C3")
    elif treatment in MASSAGE_TREAT:
        special_code_list.append("C4")
    elif treatment in DISLOCATE_TREAT:
        # special_code_list.append('C5')
        special_code_list.append("C4")  # 2021.03.01 取消脫臼整復類別

    if regist_type in TELECOM_TYPE or injury in INFECTIOUS_INJURY_TYPE:
        special_code_list.append("EE")  # 2021.05.20 COVID-19

    special_code_list = special_code_list + [None] * (4 - len(special_code_list))
    return special_code_list


def get_visit(database, row):
    if string_utils.xstr(row["RegistType"]) in TOUR_TYPE:  # 巡迴醫療不可申報初診照護
        return None

    if (
        string_utils.xstr(row["RegistType"]) in LONG_TERM_CARE
    ):  # 2025-12-19 照護機構中醫照護
        return None

    if (
        string_utils.xstr(row["TreatType"]) in AUXILIARY_CARE_TREAT
    ):  # 腦血管疾病, 小兒氣喘, 小兒腦麻不可申報初診照護
        return None

    if string_utils.xstr(row["TreatType"]) in IMPROVE_CARE_TREAT:  # 2021-10-12 加強照護
        return None

    if (
        string_utils.xstr(row["Injury"]) in OCCUPATIONAL_INJURY_TYPE
    ):  # 2022-11-06 職業災害
        return None

    if (
        string_utils.xstr(row["Share"]) in INFECTIOUS_INJURY_TYPE
        or string_utils.xstr(row["Injury"]) in INFECTIOUS_INJURY_TYPE
    ):  # 法定傳染病通報隔離 不得申報初診照護
        return None

    age_year, _ = date_utils.get_age(row["Birthday"], row["CaseDate"])
    if (
        age_year is not None and age_year < 4
    ):  # 未滿四歲兒童不可申報初診照護 (診察費已加成) 2023.08.16 健保署北區業務組通知
        return None

    patient_key = row["PatientKey"]
    if string_utils.xstr(row["Visit"]) == "初診":
        case_date = row["CaseDate"].strftime("%Y-%m-%d")
        sql = f'''
            SELECT CaseKey FROM cases
            WHERE
                InsType = "健保" AND
                PatientKey = {patient_key} AND
                DATE(CaseDate) < "{case_date}"
        '''
        rows = database.select_record(sql)
        if len(rows) <= 0:  # 真的沒來過
            return "初診照護"

    visit_year = 2  # 2年內無看診
    case_key = row["CaseKey"]
    current_case_date = row["CaseDate"]  # 假設這是 datetime 物件

    # 1. 計算兩年前的同一天
    # 處理閏年 2/29 的特殊情況，若兩年前沒那天，則取 3/1
    try:
        years_ago = current_case_date.replace(year=current_case_date.year - visit_year)
    except ValueError:
        years_ago = current_case_date.replace(
            year=current_case_date.year - visit_year, month=3, day=1
        )

    years_ago_str = years_ago.strftime("%Y-%m-%d")
    case_date_str = current_case_date.strftime("%Y-%m-%d")

    # 2. 修改 SQL 邏輯
    # 修正重點：
    # - 增加 DATE(CaseDate) < "{case_date_str}" 確保只找過去的紀錄
    # - 使用 LIMIT 1 提高效能
    sql = f'''
        SELECT CaseKey FROM cases
        WHERE
            InsType = "健保" AND
            PatientKey = {patient_key} AND
            CaseKey != {case_key} AND
            DATE(CaseDate) >= "{years_ago_str}" AND
            DATE(CaseDate) < "{case_date_str}"
        LIMIT 1
    '''

    # try:
    #     if row['CaseDate'].month == 1:
    #         first_visit_year_range = row['CaseDate'].replace(
    #             year=row['CaseDate'].year - visit_year - 1,
    #             month=12,
    #             day=1
    #         )
    #     else:
    #         first_visit_year_range = row['CaseDate'].replace(
    #             year=row['CaseDate'].year - visit_year,
    #             month=row['CaseDate'].month - 1,
    #             day=1
    #         )
    # except ValueError:
    #     return None

    # first_visit_year_range = first_visit_year_range.strftime('%Y-%m-%d')
    # sql = f'''
    #     SELECT CaseKey FROM cases
    #     WHERE
    #         InsType = "健保" AND
    #         PatientKey = {patient_key} AND
    #         CaseKey != {case_key} AND
    #         DATE(CaseDate) >= "{first_visit_year_range}"
    # '''
    rows = database.select_record(sql)

    if len(rows) <= 0:  # 2年內無看診
        return "初診照護"

    return None


# 調劑方式: 0-自行調劑 1-交付調劑 2-未開處方
def get_pres_type(pres_days):
    pres_type = 2
    if pres_days > 0:
        pres_type = 0

    return pres_type


def get_pharmacist_id(database, system_settings, row):
    pres_days = case_utils.get_pres_days(database, row["CaseKey"])

    if pres_days <= 0:
        return None

    if string_utils.xstr(row["PharmacyType"]) != "申報":
        return None

    if number_utils.get_integer(row["PharmacyFee"]) <= 0:
        return None

    pharmacist_name = string_utils.xstr(row["Pharmacist"])
    if (
        pharmacist_name == ""
        and number_utils.get_integer(system_settings.field("藥師人數")) > 0
    ):
        pharmacist_name = personnel_utils.get_default_pharmacist(database)

    if pharmacist_name == "":
        pharmacist_name = string_utils.xstr(row["Doctor"])

    pharmacist_id = personnel_utils.get_person_field_value(
        database, pharmacist_name, "ID"
    )

    return pharmacist_id


def get_diag_code(
    database, system_settings, doctor_name, regist_type, treat_type, diag_fee
):
    if diag_fee <= 0:
        return None

    if (
        treat_type in CARE_TREAT and treat_type != "兒童鼻炎"
    ):  # 特殊照護且非兒童過敏性鼻炎不可申報診察費
        return None

    if treat_type in HOME_CARE:  # 居家醫療
        diag_code = get_home_care_ins_code(database, regist_type)

        return diag_code

    nurse = number_utils.get_integer(system_settings.field("護士人數"))
    if regist_type in TOUR_MOUNTAIN_ISLAND:  # 山地離島診察費
        if nurse > 0:
            diag_code = "A09"  # 診察費第一段有護理師
        else:
            diag_code = "A10"  # 診察費第一段無護理師
    else:
        if nurse > 0:
            diag_code = "A01"  # 診察費第一段有護理師
        else:
            diag_code = "A02"  # 診察費第一段無護理師

    # 2026-04-24 修改: 2026-04-01起，支援醫師可以申報A01
    # position = personnel_utils.get_person_field_value(database, doctor_name, "Position")
    # if position == "支援醫師":
    #     diag_code = "A02"

    return diag_code


# 藥服代號: A31-A32;  6次: 120010: 0-無調劑 1-A31藥師 2-A32醫師
def get_pharmacy_code(system_settings, row, pres_days, pharmacy_code="000000"):
    treat_type = string_utils.xstr(row["TreatType"])
    if treat_type in IMPROVE_CARE_TREAT and treat_type not in [
        "兒童鼻炎",
        "癌症中醫門診延長照護",
    ]:  # 加強照護不可申報調劑費, 兒童鼻炎及癌症中醫門診延長照護除外
        return pharmacy_code

    pharmacy_code = [x for x in pharmacy_code]
    course = number_utils.get_integer(row["Continuance"])

    if course >= 1:
        course -= 1
    else:
        course = 0

    if pres_days <= 0:
        pharmacy_code[course] = "0"
    elif string_utils.xstr(row["PharmacyType"]) == "申報":
        pharmacist = system_settings.field("藥師人數")
        if int(pharmacist) > 0:
            pharmacy_code[course] = "1"
        else:
            pharmacy_code[course] = "2"
    else:
        pharmacy_code[course] = "0"

    return "".join(pharmacy_code)


# 藥服代號: A31-A32;  居家照護: 120010: 0-無調劑 1-A31藥師 2-A32醫師
def get_home_care_pharmacy_code(database, system_settings, treat_records):
    pharmacy_code = ""
    for record_count in range(MAX_COURSE):
        case_key = treat_records[record_count]["CaseKey"]
        if case_key == 0:
            pharmacy_code += "0"
            continue

        pres_days = case_utils.get_pres_days(database, case_key)
        sql = f"""
            SELECT PharmacyType FROM cases
            WHERE
                CaseKey = {case_key}
        """
        rows = database.select_record(sql)
        if len(rows) <= 0:
            pharmacy_code += "0"
            continue

        row = rows[0]
        if pres_days <= 0:
            pharmacy_code += "0"
        elif string_utils.xstr(row["PharmacyType"]) == "申報":
            pharmacist = system_settings.field("藥師人數")
            if int(pharmacist) > 0:
                pharmacy_code += "1"
            else:
                pharmacy_code += "2"
        else:
            pharmacy_code += "0"

    return pharmacy_code


def get_treat_records(database, row, ins_apply_row=None):
    if ins_apply_row is not None:
        treat_records = [
            {
                "CaseKey": number_utils.get_integer(ins_apply_row["CaseKey1"]),
                "TreatCode": string_utils.xstr(ins_apply_row["TreatCode1"]),
                "TreatFee": number_utils.get_integer(ins_apply_row["TreatFee1"]),
                "Percent": number_utils.get_integer(ins_apply_row["Percent1"]),
            },
            {
                "CaseKey": number_utils.get_integer(ins_apply_row["CaseKey2"]),
                "TreatCode": string_utils.xstr(ins_apply_row["TreatCode2"]),
                "TreatFee": number_utils.get_integer(ins_apply_row["TreatFee2"]),
                "Percent": number_utils.get_integer(ins_apply_row["Percent2"]),
            },
            {
                "CaseKey": number_utils.get_integer(ins_apply_row["CaseKey3"]),
                "TreatCode": string_utils.xstr(ins_apply_row["TreatCode3"]),
                "TreatFee": number_utils.get_integer(ins_apply_row["TreatFee3"]),
                "Percent": number_utils.get_integer(ins_apply_row["Percent3"]),
            },
            {
                "CaseKey": number_utils.get_integer(ins_apply_row["CaseKey4"]),
                "TreatCode": string_utils.xstr(ins_apply_row["TreatCode4"]),
                "TreatFee": number_utils.get_integer(ins_apply_row["TreatFee4"]),
                "Percent": number_utils.get_integer(ins_apply_row["Percent4"]),
            },
            {
                "CaseKey": number_utils.get_integer(ins_apply_row["CaseKey5"]),
                "TreatCode": string_utils.xstr(ins_apply_row["TreatCode5"]),
                "TreatFee": number_utils.get_integer(ins_apply_row["TreatFee5"]),
                "Percent": number_utils.get_integer(ins_apply_row["Percent5"]),
            },
            {
                "CaseKey": number_utils.get_integer(ins_apply_row["CaseKey6"]),
                "TreatCode": string_utils.xstr(ins_apply_row["TreatCode6"]),
                "TreatFee": number_utils.get_integer(ins_apply_row["TreatFee6"]),
                "Percent": number_utils.get_integer(ins_apply_row["Percent6"]),
            },
            {
                "CaseKey": number_utils.get_integer(ins_apply_row["CaseKey7"]),
                "TreatCode": string_utils.xstr(ins_apply_row["TreatCode7"]),
                "TreatFee": number_utils.get_integer(ins_apply_row["TreatFee7"]),
                "Percent": number_utils.get_integer(ins_apply_row["Percent7"]),
            },
            {
                "CaseKey": number_utils.get_integer(ins_apply_row["CaseKey8"]),
                "TreatCode": string_utils.xstr(ins_apply_row["TreatCode8"]),
                "TreatFee": number_utils.get_integer(ins_apply_row["TreatFee8"]),
                "Percent": number_utils.get_integer(ins_apply_row["Percent8"]),
            },
            {
                "CaseKey": number_utils.get_integer(ins_apply_row["CaseKey9"]),
                "TreatCode": string_utils.xstr(ins_apply_row["TreatCode9"]),
                "TreatFee": number_utils.get_integer(ins_apply_row["TreatFee9"]),
                "Percent": number_utils.get_integer(ins_apply_row["Percent9"]),
            },
            {
                "CaseKey": number_utils.get_integer(ins_apply_row["CaseKey10"]),
                "TreatCode": string_utils.xstr(ins_apply_row["TreatCode10"]),
                "TreatFee": number_utils.get_integer(ins_apply_row["TreatFee10"]),
                "Percent": number_utils.get_integer(ins_apply_row["Percent10"]),
            },
            {
                "CaseKey": number_utils.get_integer(ins_apply_row["CaseKey11"]),
                "TreatCode": string_utils.xstr(ins_apply_row["TreatCode11"]),
                "TreatFee": number_utils.get_integer(ins_apply_row["TreatFee11"]),
                "Percent": number_utils.get_integer(ins_apply_row["Percent11"]),
            },
            {
                "CaseKey": number_utils.get_integer(ins_apply_row["CaseKey12"]),
                "TreatCode": string_utils.xstr(ins_apply_row["TreatCode12"]),
                "TreatFee": number_utils.get_integer(ins_apply_row["TreatFee12"]),
                "Percent": number_utils.get_integer(ins_apply_row["Percent12"]),
            },
            {
                "CaseKey": number_utils.get_integer(ins_apply_row["CaseKey13"]),
                "TreatCode": string_utils.xstr(ins_apply_row["TreatCode13"]),
                "TreatFee": number_utils.get_integer(ins_apply_row["TreatFee13"]),
                "Percent": number_utils.get_integer(ins_apply_row["Percent13"]),
            },
            {
                "CaseKey": number_utils.get_integer(ins_apply_row["CaseKey14"]),
                "TreatCode": string_utils.xstr(ins_apply_row["TreatCode14"]),
                "TreatFee": number_utils.get_integer(ins_apply_row["TreatFee14"]),
                "Percent": number_utils.get_integer(ins_apply_row["Percent14"]),
            },
            {
                "CaseKey": number_utils.get_integer(ins_apply_row["CaseKey15"]),
                "TreatCode": string_utils.xstr(ins_apply_row["TreatCode15"]),
                "TreatFee": number_utils.get_integer(ins_apply_row["TreatFee15"]),
                "Percent": number_utils.get_integer(ins_apply_row["Percent15"]),
            },
        ]
    else:
        treat_records = [
            {  # 1
                "CaseKey": 0,
                "TreatCode": None,
                "TreatFee": 0,
                "Percent": 100,
            },
            {  # 2
                "CaseKey": 0,
                "TreatCode": None,
                "TreatFee": 0,
                "Percent": 100,
            },
            {  # 3
                "CaseKey": 0,
                "TreatCode": None,
                "TreatFee": 0,
                "Percent": 100,
            },
            {  # 4
                "CaseKey": 0,
                "TreatCode": None,
                "TreatFee": 0,
                "Percent": 100,
            },
            {  # 5
                "CaseKey": 0,
                "TreatCode": None,
                "TreatFee": 0,
                "Percent": 100,
            },
            {  # 6
                "CaseKey": 0,
                "TreatCode": None,
                "TreatFee": 0,
                "Percent": 100,
            },
            {  # 7
                "CaseKey": 0,
                "TreatCode": None,
                "TreatFee": 0,
                "Percent": 100,
            },
            {  # 8
                "CaseKey": 0,
                "TreatCode": None,
                "TreatFee": 0,
                "Percent": 100,
            },
            {  # 9
                "CaseKey": 0,
                "TreatCode": None,
                "TreatFee": 0,
                "Percent": 100,
            },
            {  # 10
                "CaseKey": 0,
                "TreatCode": None,
                "TreatFee": 0,
                "Percent": 100,
            },
            {  # 11
                "CaseKey": 0,
                "TreatCode": None,
                "TreatFee": 0,
                "Percent": 100,
            },
            {  # 12
                "CaseKey": 0,
                "TreatCode": None,
                "TreatFee": 0,
                "Percent": 100,
            },
            {  # 13
                "CaseKey": 0,
                "TreatCode": None,
                "TreatFee": 0,
                "Percent": 100,
            },
            {  # 14
                "CaseKey": 0,
                "TreatCode": None,
                "TreatFee": 0,
                "Percent": 100,
            },
            {  # 15
                "CaseKey": 0,
                "TreatCode": None,
                "TreatFee": 0,
                "Percent": 100,
            },
        ]

    if string_utils.xstr(row["TreatType"]) == "腦血管疾病":
        if treat_records[0]["CaseKey"] == 0:
            treat_records[0]["CaseKey"] = number_utils.get_integer(row["CaseKey"])
            treat_records[1]["CaseKey"] = 1  # CaseKey2 = 腦血管疾病次數 redefine
        else:
            treat_records[1]["CaseKey"] += 1

        treat_records[0]["TreatCode"] = get_brain_treat_code(
            treat_records[1]["CaseKey"]
        )
        treat_records[0]["TreatFee"] = charge_utils.get_ins_fee_from_ins_code(
            database,
            treat_records[0]["TreatCode"],
            case_date=row["CaseDate"],
        )

        return treat_records
    elif string_utils.xstr(row["TreatType"]) in ["小兒氣喘", "小兒腦性麻痺"]:
        treat_records[0]["CaseKey"] = number_utils.get_integer(row["CaseKey"])
        treat_records[0]["TreatCode"] = get_child_treat_code(
            database, treat_records[0]["CaseKey"]
        )
        treat_records[0]["TreatFee"] = charge_utils.get_ins_fee_from_ins_code(
            database,
            treat_records[0]["TreatCode"],
            case_date=row["CaseDate"],
        )

        return treat_records
    elif string_utils.xstr(row["TreatType"]) in ["居家醫療"]:
        for case_count in range(MAX_HOME_CARE):
            if treat_records[case_count]["CaseKey"] == 0:
                treat_records[case_count]["CaseKey"] = number_utils.get_integer(
                    row["CaseKey"]
                )
                treat_records[case_count]["TreatCode"] = get_treat_code(
                    database, treat_records[case_count]["CaseKey"]
                )
                treat_records[case_count]["TreatFee"] = (
                    number_utils.get_integer(row["AcupunctureFee"])
                    + number_utils.get_integer(row["MassageFee"])
                    + number_utils.get_integer(row["DislocateFee"])
                )
                break

        return treat_records

    course = number_utils.get_integer(row["Continuance"])
    if course <= 1:
        course = 0
    else:
        course -= 1

    treat_records[course]["CaseKey"] = number_utils.get_integer(row["CaseKey"])
    treat_records[course]["TreatCode"] = get_treat_code(
        database, treat_records[course]["CaseKey"]
    )

    if string_utils.xstr(row["TreatType"]) in ["慢性腎病照護"]:
        treat_records[course]["TreatFee"] = (
            number_utils.get_integer(row["AcupunctureFee"])
            + number_utils.get_integer(row["MassageFee"])
            + number_utils.get_integer(row["DislocateFee"])
        )
    elif (
        string_utils.xstr(row["TreatType"]) in CARE_TREAT
    ):  # 加強照護類不含脫臼費(redefine 照護費)
        treat_records[course]["TreatFee"] = number_utils.get_integer(
            row["AcupunctureFee"]
        ) + number_utils.get_integer(row["MassageFee"])
    else:
        treat_records[course]["TreatFee"] = (
            number_utils.get_integer(row["AcupunctureFee"])
            + number_utils.get_integer(row["MassageFee"])
            + number_utils.get_integer(row["DislocateFee"])
        )

    return treat_records


# 取得腦血管疾病醫令
def get_brain_treat_code(record_count):
    if record_count <= 3:
        treat_code = "C05"
    elif record_count <= 6:
        treat_code = "C06"
    elif record_count <= 9:
        treat_code = "C07"
    elif record_count <= 12:
        treat_code = "C08"
    else:
        treat_code = "C09"

    return treat_code


# 取得腦血管疾病醫令
def get_child_treat_code(database, case_key):
    sql = f"""
        SELECT InsCode FROM prescript
        WHERE
            CaseKey = {case_key} AND
            MedicineSet = 11 AND
            MedicineType = "照護"
    """
    rows = database.select_record(sql)

    if len(rows) <= 0:
        treat_code = ""
    else:
        treat_code = string_utils.xstr(rows[0]["InsCode"])

    return treat_code


# 取得療程開始日期
def get_start_date(database, row):
    case_date = row["CaseDate"].date()
    if number_utils.get_integer(row["Continuance"]) <= 1:  # 內科或療程首次日期
        return case_date

    card = string_utils.xstr(row["Card"])
    last_month = datetime.date(case_date.year, case_date.month, 1) - datetime.timedelta(
        1
    )
    start_date = last_month.replace(day=1).strftime("%Y-%m-%d 00:00:00")

    current_date = row["CaseDate"]
    patient_key = row["PatientKey"]
    sql = f'''
        SELECT CaseDate FROM cases
        WHERE
            CaseDate BETWEEN "{start_date}" AND "{current_date}" AND
            CaseDate < "{current_date}" AND
            PatientKey = {patient_key} AND
            Card = "{card}" AND
            Continuance <= 1
        ORDER BY CaseDate DESC LIMIT 1
    '''
    rows = database.select_record(sql)
    if len(rows) <= 0:
        return case_date

    return rows[0]["CaseDate"]


def pharmacist_schedule_on_duty(database, case_key):
    on_duty = False, None

    case_date, period = case_utils.get_case_date(database, case_key)
    if case_date is None:
        return on_duty

    sql = f'''
        SELECT Pharmacist1, Pharmacist2, Pharmacist3 FROM pharmacist_schedule
        WHERE
            ScheduleDate = "{case_date.date()}"
    '''
    rows = database.select_record(sql)

    if len(rows) <= 0:
        return on_duty

    if period == "早班":
        index = 1
    elif period == "午班":
        index = 2
    elif period == "晚班":
        index = 3
    else:
        index = 1

    pharmacist = string_utils.xstr(rows[0][f"Pharmacist{index}"])
    if pharmacist != "":
        on_duty = True, pharmacist

    return on_duty


def nurse_schedule_on_duty(database, case_key, doctor_name):
    on_duty = False

    sql = f"""
        SELECT CaseDate, Period, Doctor
        FROM cases
        WHERE
            CaseKey = {case_key}
    """
    rows = database.select_record(sql)

    if len(rows) <= 0:
        return on_duty

    case_date = rows[0]["CaseDate"].date()
    period = string_utils.xstr(rows[0]["Period"])
    doctor_name = string_utils.xstr(rows[0]["Doctor"])

    sql = f'''
        SELECT * FROM nurse_schedule
        WHERE
            ScheduleDate = "{case_date}" AND
            Doctor = "{doctor_name}"
    '''
    rows = database.select_record(sql)

    if len(rows) <= 0:
        return on_duty

    nurse = ""
    if period == "早班":
        nurse = rows[0]["Nurse1"]
    elif period == "午班":
        nurse = rows[0]["Nurse2"]
    elif period == "晚班":
        nurse = rows[0]["Nurse3"]

    if string_utils.xstr(nurse) != "":
        on_duty = True

    return on_duty


def get_ins_xml_file_name(system_settings, apply_type, apply_date, prefix=None):
    apply_dir = get_dir(system_settings, "申報路徑")
    xml_file_name = f"{apply_dir}/{apply_date}-{apply_type}"
    if prefix is not None:
        xml_file_name += f"-{prefix}"

    xml_file_name += ".xml"

    return xml_file_name


def get_ins_appeal_xml_file_name(system_settings, apply_type, apply_date):
    apply_dir = get_dir(system_settings, "申報路徑")
    clinic_id = system_settings.field("院所代號")
    clinic_type = "14"  # 中醫
    monthly_remark = "0"  # 全月
    encoding = "B"  # Big5

    if apply_type == "1":
        apply_type = "4"  # 申復送核
    elif apply_type == "2":
        apply_type = "5"  # 申復補報

    xml_file_name = f"{apply_dir}/{clinic_id}{clinic_type}{apply_date}{apply_type}{monthly_remark}{encoding}.xml"

    return xml_file_name


def get_apply_date(apply_year, apply_month):
    apply_date = f"{apply_year - 1911:0>3}{apply_month:0>2}"

    return apply_date


def extract_pharmacy_code(pharmacy_code_str):
    pharmacy_count = 0
    pharmacy_code = ""
    for i in range(len(pharmacy_code_str)):
        if pharmacy_code_str[i] in ["1", "2"]:
            pharmacy_code = f"A3{pharmacy_code_str[i]}"
            pharmacy_count += 1

        if pharmacy_count >= 2:
            pharmacy_code = ""
            break

    return pharmacy_code


def get_usage(instruction):
    if "飯前" in instruction:
        usage = "AC"
    elif "飯後" in instruction:
        usage = "PC"
    else:
        usage = "PC"

    return usage


def get_disease_rows(database, disease_list):
    disease_rows = []
    for disease in disease_list:
        if type(disease) is tuple:
            start_disease = disease[0].split("-")[0]
            end_disease = disease[0].split("-")[1]

            sql = f'''
                SELECT ICDCode FROM icd10
                WHERE
                    ICDCode BETWEEN "{start_disease}" AND "{end_disease}" OR
                    ICDCode LIKE "{end_disease}%"
                ORDER BY ICDCode
            '''
            icd_rows = database.select_record(sql)
        else:
            sql = f'''
                SELECT ICDCode FROM icd10
                WHERE
                    ICDCode LIKE "{disease}%"
                ORDER BY ICDCode
            '''
            icd_rows = database.select_record(sql)

        for icd_row in icd_rows:
            icd_code = string_utils.xstr(icd_row["ICDCode"])
            sql = f'''
                SELECT ICDCode FROM icd10
                WHERE
                    ICDCode LIKE "{icd_code}%"
                LIMIT 2
            '''
            temp_rows = database.select_record(sql)

            if len(temp_rows) == 1:
                disease_rows.append(string_utils.xstr(temp_rows[0]["ICDCode"]))

    return disease_rows


def get_complicated_acupuncture_rows(database, groups_name, disease=1):
    disease_rows = []
    rows = icd10_utils.COMPLICATED_ACUPUNCTURE_DISEASE_DICT[groups_name]
    for row in rows:
        disease_list1, disease_list2 = row[0], row[1]
        if disease == 1:
            disease_list = disease_list1
        else:
            disease_list = disease_list2

        disease_row = get_disease_rows(database, disease_list)
        disease_rows += disease_row

    return disease_rows


def get_complicated_acupuncture_list(database, disease=1):
    disease_rows = []
    for row in list(icd10_utils.COMPLICATED_ACUPUNCTURE_DISEASE_DICT.keys()):
        rows = get_complicated_acupuncture_rows(database, row, disease)
        disease_rows += rows

    return disease_rows


def get_moderate_complicated_acupuncture_rows(database, groups_name, disease=1):
    disease_rows = []
    rows = icd10_utils.MODERATE_COMPLICATED_ACUPUNCTURE_DISEASE_DICT[groups_name]
    for row in rows:
        disease_list1, disease_list2 = row[0], row[1]
        if disease == 1:
            disease_list = disease_list1
        else:
            disease_list = disease_list2

        disease_row = get_disease_rows(database, disease_list)
        disease_rows += disease_row

    return disease_rows


def get_moderate_complicated_acupuncture_list(database, disease=1):
    disease_rows = []
    for row in list(icd10_utils.MODERATE_COMPLICATED_ACUPUNCTURE_DISEASE_DICT.keys()):
        rows = get_moderate_complicated_acupuncture_rows(database, row, disease)
        disease_rows += rows

    return disease_rows


def get_highly_complicated_acupuncture_rows(database, groups_name, disease=1):
    disease_rows = []
    rows = icd10_utils.HIGHLY_COMPLICATED_ACUPUNCTURE_DISEASE_DICT[groups_name]
    for row in rows:
        disease_list1, disease_list2 = row[0], row[1]
        if disease == 1:
            disease_list = disease_list1
        else:
            disease_list = disease_list2

        disease_row = get_disease_rows(database, disease_list)
        disease_rows += disease_row

    return disease_rows


def get_highly_complicated_acupuncture_list(database, disease=1):
    disease_rows = []
    for row in list(icd10_utils.HIGHLY_COMPLICATED_ACUPUNCTURE_DISEASE_DICT.keys()):
        rows = get_highly_complicated_acupuncture_rows(database, row, disease)
        disease_rows += rows

    return disease_rows


def get_complicated_massage_rows(database, groups_name, disease=1):
    disease_rows = []
    rows = icd10_utils.COMPLICATED_MASSAGE_DISEASE_DICT[groups_name]
    for row in rows:
        disease_list1, disease_list2 = row[0], row[1]
        if disease == 1:
            disease_list = disease_list1
        else:
            disease_list = disease_list2

        disease_row = get_disease_rows(database, disease_list)
        disease_rows += disease_row

    return disease_rows


def get_moderate_complicated_massage_rows(database, groups_name, disease=1):
    disease_rows = []
    rows = icd10_utils.MODERATE_COMPLICATED_MASSAGE_DISEASE_DICT[groups_name]
    for row in rows:
        disease_list1, disease_list2 = row[0], row[1]
        if disease == 1:
            disease_list = disease_list1
        else:
            disease_list = disease_list2

        disease_row = get_disease_rows(database, disease_list)
        disease_rows += disease_row

    return disease_rows


def get_moderate_complicated_massage_list(database, disease=1):
    disease_rows = []
    for row in list(icd10_utils.MODERATE_COMPLICATED_MASSAGE_DISEASE_DICT.keys()):
        rows = get_moderate_complicated_massage_rows(database, row, disease)
        disease_rows += rows

    return disease_rows


def get_highly_complicated_massage_rows(database, groups_name, disease=1):
    disease_rows = []
    rows = icd10_utils.HIGHLY_COMPLICATED_MASSAGE_DISEASE_DICT[groups_name]
    for row in rows:
        disease_list1, disease_list2 = row[0], row[1]
        if disease == 1:
            disease_list = disease_list1
        else:
            disease_list = disease_list2

        disease_row = get_disease_rows(database, disease_list)
        disease_rows += disease_row

    return disease_rows


def get_highly_complicated_massage_list(database, disease=1):
    disease_rows = []
    for row in list(icd10_utils.HIGHLY_COMPLICATED_MASSAGE_DISEASE_DICT.keys()):
        rows = get_highly_complicated_massage_rows(database, row, disease)
        disease_rows += rows

    return disease_rows


def get_moderate_complicated_massage_with_special_disease_rows(
    database, groups_name, disease=1
):
    disease_rows = []
    rows = icd10_utils.MODERATE_COMPLICATED_MASSAGE_WITH_SPECIAL_DISEASE_DICT[
        groups_name
    ]
    for row in rows:
        disease_list1, disease_list2 = row[0], row[1]
        if disease == 1:
            disease_list = disease_list1
        else:
            disease_list = disease_list2

        disease_row = get_disease_rows(database, disease_list)
        disease_rows += disease_row

    return disease_rows


def get_moderate_complicated_massage_with_special_disease_list(database, disease=1):
    disease_rows = []
    for row in list(
        icd10_utils.MODERATE_COMPLICATED_MASSAGE_WITH_SPECIAL_DISEASE_DICT.keys()
    ):
        rows = get_moderate_complicated_massage_with_special_disease_rows(
            database, row, disease
        )
        disease_rows += rows

    return disease_rows


def get_dislocate_rows(database, groups_name, disease=1):
    disease_rows = []
    rows = icd10_utils.DISLOCATE_DICT[groups_name]
    for row in rows:
        disease_list1, disease_list2 = row[0], row[1]
        if disease == 1:
            disease_list = disease_list1
        else:
            disease_list = disease_list2

        disease_row = get_disease_rows(database, disease_list)
        disease_rows += disease_row

    return disease_rows


def get_dislocate_list(database, disease=1):
    disease_rows = []
    for row in list(icd10_utils.DISLOCATE_DICT.keys()):
        rows = get_dislocate_rows(database, row, disease)
        disease_rows += rows

    return disease_rows


def get_fracture_rows(database, groups_name, disease=1):
    disease_rows = []
    rows = icd10_utils.FRACTURE_DICT[groups_name]
    for row in rows:
        disease_list1, disease_list2 = row[0], row[1]
        if disease == 1:
            disease_list = disease_list1
        else:
            disease_list = disease_list2

        disease_row = get_disease_rows(database, disease_list)
        disease_rows += disease_row

    return disease_rows


def get_fracture_list(database, disease=1):
    disease_rows = []
    for row in list(icd10_utils.FRACTURE_DICT.keys()):
        rows = get_fracture_rows(database, row, disease)
        disease_rows += rows

    return disease_rows


def get_ins_special_care_rows(database, groups_name, disease=1):
    disease_rows = []
    rows = icd10_utils.INS_SPECIAL_CARE_DICT[groups_name]
    for row in rows:
        disease_list1, disease_list2 = row[0], row[1]
        if disease == 1:
            disease_list = disease_list1
        else:
            disease_list = disease_list2

        disease_row = get_disease_rows(database, disease_list)
        disease_rows += disease_row

    return disease_rows


def get_custom_groups_name_rows(database, custom_dict, groups_name, disease=1):
    disease_rows = []
    rows = custom_dict[groups_name]
    for row in rows:
        disease_list1, disease_list2 = row[0], row[1]
        if disease == 1:
            disease_list = disease_list1
        else:
            disease_list = disease_list2

        disease_row = get_disease_rows(database, disease_list)
        disease_rows += disease_row

    return disease_rows


def get_complicated_massage_list(database, disease=1):
    disease_rows = []
    for row in list(icd10_utils.COMPLICATED_MASSAGE_DISEASE_DICT.keys()):
        rows = get_complicated_massage_rows(database, row, disease)
        disease_rows += rows

    return disease_rows


def get_ins_special_care_list(database, disease=1):
    disease_rows = []
    for row in list(icd10_utils.INS_SPECIAL_CARE_DICT.keys()):
        rows = get_ins_special_care_rows(database, row, disease)
        disease_rows += rows

    return disease_rows


def NHI_SendB(system_settings, type_code, dest_file):
    if sys.platform == "win32":
        dest_file = dest_file.replace("/", "\\")

    title = "上傳健保資料"
    message = '<font size="5" color="red"><b>正在上傳健保資料中, 請稍後...</b></font>'
    hint = "正在與與健保IDC資訊中心連線, 會花費一些時間."
    msg_box = dialog_utils.message_box(title, message, hint)
    msg_box.show()

    msg_queue = Queue()
    QtCore.QCoreApplication.processEvents()

    t = Thread(
        target=NHI_SendB_thread,
        args=(
            msg_queue,
            system_settings,
            type_code,
            dest_file,
        ),
    )
    t.start()
    (error_code, local_id, nhi_id) = msg_queue.get()
    msg_box.close()

    if error_code != 0:
        error_message = nhi_eii_api_error_code[error_code]
    else:
        local_id = local_id.value.decode("utf8")
        nhi_id = nhi_id.value.decode("utf8")
        error_message = f"""
            上傳成功<br>
            本機作業碼: {local_id}<br>
            IDC作業碼: {nhi_id}
        """

    system_utils.show_message_box(
        QMessageBox.Information,
        "上傳結果",
        f'<font size="5" color="red"><b>{error_message}</b></font>',
        "若上傳成功, 請於30分鐘後至健保VPN網站查看上傳結果.",
    )


def NHI_DownloadB_thread(out_queue, system_settings, type_code, dest_file):
    BASE_DIR = os.path.abspath(os.path.join(os.path.dirname("__file__")))

    dll_file = os.path.join(BASE_DIR, "cnhi_eiiapi.dll")
    if system_settings.field("讀卡機類型") == "健保讀卡機":
        dll_file = os.path.join(BASE_DIR, "nhi_eiiapi.dll")

    nhi_eii_api = ctypes.windll.LoadLibrary(dll_file)

    com_port = (
        number_utils.get_integer(system_settings.field("健保卡讀卡機連接埠")) - 1
    )  # com1=0, com2=1, com3=2,...
    reader_file = os.path.join(BASE_DIR, "reader.dll")

    p_reader_file = ctypes.c_char_p(reader_file.encode("ascii"))
    p_type_code = ctypes.c_char_p(type_code.encode("ascii"))
    p_dest_file = ctypes.c_char_p(dest_file.encode("ascii"))

    local_id = ctypes.c_buffer(12)
    nhi_id = ctypes.c_buffer(12)
    error_code = nhi_eii_api.NHI_DownloadB(
        com_port,
        p_reader_file,
        p_dest_file,
        p_type_code,
        local_id,
        nhi_id,
    )

    out_queue.put((error_code, local_id, nhi_id))


def NHI_DownloadB(system_settings, type_code, dest_file):
    if sys.platform == "win32":
        dest_file = dest_file.replace("/", "\\")

    title = "下載健保資料"
    message = '<font size="5" color="red"><b>正在下載健保資料中, 請稍後...</b></font>'
    hint = "正在與與健保IDC資訊中心連線, 會花費一些時間."
    msg_box = dialog_utils.message_box(title, message, hint)
    msg_box.show()

    msg_queue = Queue()
    QtCore.QCoreApplication.processEvents()

    t = Thread(
        target=NHI_DownloadB_thread,
        args=(
            msg_queue,
            system_settings,
            type_code,
            dest_file,
        ),
    )
    t.start()
    (error_code, local_id, nhi_id) = msg_queue.get()
    msg_box.close()

    if error_code != 0:
        error_message = nhi_eii_api_error_code[error_code]
        local_id = None
        nhi_id = None
    else:
        local_id = local_id.value.decode("utf8")
        nhi_id = nhi_id.value.decode("utf8")
        error_message = f"""
            下載成功<br>
            本機作業碼: {local_id}<br>
            IDC作業碼: {nhi_id}
        """

    system_utils.show_message_box(
        QMessageBox.Information,
        "下載結果",
        f'<font size="5" color="red"><b>{error_message}</b></font>',
        "若下載成功, 請於30分鐘後繼續下一個步驟.",
    )

    return local_id, nhi_id


def NHI_GetB_thread(out_queue, system_settings, local_id, nhi_id):
    BASE_DIR = os.path.abspath(os.path.join(os.path.dirname("__file__")))

    dll_file = os.path.join(BASE_DIR, "cnhi_eiiapi.dll")
    if system_settings.field("讀卡機類型") == "健保讀卡機":
        dll_file = os.path.join(BASE_DIR, "nhi_eiiapi.dll")

    nhi_eii_api = ctypes.windll.LoadLibrary(dll_file)

    com_port = (
        number_utils.get_integer(system_settings.field("健保卡讀卡機連接埠")) - 1
    )  # com1=0, com2=1, com3=2,...
    reader_file = os.path.join(BASE_DIR, "reader.dll")
    download_path = get_dir(system_settings, "申報路徑")

    p_reader_file = ctypes.c_char_p(reader_file.encode("ascii"))
    p_local_id = ctypes.c_char_p(local_id.encode("ascii"))
    p_nhi_id = ctypes.c_char_p(nhi_id.encode("ascii"))
    p_download_path = ctypes.c_char_p(download_path.encode("ascii"))

    local_id = ctypes.c_buffer(12)
    nhi_id = ctypes.c_buffer(12)
    error_code = nhi_eii_api.NHI_GetB(
        com_port,
        p_reader_file,
        p_local_id,
        p_nhi_id,
        p_download_path,
    )

    out_queue.put((error_code))


def NHI_GetB(system_settings, local_id, nhi_id):
    title = "下載健保資料"
    message = '<font size="5" color="red"><b>正在下載健保資料中, 請稍後...</b></font>'
    hint = "正在與與健保IDC資訊中心連線, 會花費一些時間."
    msg_box = dialog_utils.message_box(title, message, hint)
    msg_box.show()

    msg_queue = Queue()
    QtCore.QCoreApplication.processEvents()

    t = Thread(
        target=NHI_GetB_thread,
        args=(
            msg_queue,
            system_settings,
            local_id,
            nhi_id,
        ),
    )
    t.start()
    (error_code) = msg_queue.get()
    msg_box.close()

    if error_code != 0:
        error_message = nhi_eii_api_error_code[error_code]
    else:
        error_message = "檔案下載成功"

    system_utils.show_message_box(
        QMessageBox.Information,
        "下載結果",
        f'<font size="5" color="red"><b>{error_message}</b></font>',
        "若下載成功, 請解壓縮後執行後續作業.",
    )

    return error_message


"""
// 回傳值: 0：無任何錯誤, 其他：參考異常碼對應。
int NHI_SendB(
    int iRs232PortNo,           // [ in]健保讀卡機連接之通訊連接埠編號，起始值為0
    char *sReaderDllPathName,   // [ in]健保讀卡機Reader.dll放置路徑，為完整路徑及檔名，
                                // 例：C:/Reader.dll
    char *sUploadFileName,      // [ in]上傳作業檔案，為完整路徑及檔名，
                                // 例：C:\3501200000110990913B.zip
    char *sTypeCode,            // [ in]上傳作業種類：
                                //      03：醫費申報資料XML格式
                                //      05：預檢醫費申報資料XML格式
                                //      07：醫療費用電子申復資料
                                //      09：預檢醫療費用電子申復資料
                                //      26：檢驗(查)每日上傳資料XML格式
    char *sLocal_ID,            // [out] 本機端回傳之作業辨識碼，供識別作業之用，使用時須搭配sNHI_ID，為12個位元組
                                //       Ansi資料，存放方式請參考範例程式碼
    char *sNHI_ID)              // [out] IDC回傳之作業辨識碼，供識別作業之用，為12個位元組
                                //       Ansi資料，存放方式請參考範例程式碼

                                // 本函式將使用者端之「上傳作業種類」檔案傳送至IDC
)
"""


def NHI_SendB_thread(out_queue, system_settings, type_code, dest_file):
    BASE_DIR = os.path.abspath(os.path.join(os.path.dirname("__file__")))

    dll_file = os.path.join(BASE_DIR, "cnhi_eiiapi.dll")
    if system_settings.field("讀卡機類型") == "健保讀卡機":
        dll_file = os.path.join(BASE_DIR, "nhi_eiiapi.dll")

    nhi_eii_api = ctypes.windll.LoadLibrary(dll_file)

    com_port = (
        number_utils.get_integer(system_settings.field("健保卡讀卡機連接埠")) - 1
    )  # com1=0, com2=1, com3=2,...
    reader_file = os.path.join(BASE_DIR, "reader.dll")

    p_reader_file = ctypes.c_char_p(reader_file.encode("ascii"))
    p_type_code = ctypes.c_char_p(type_code.encode("ascii"))
    p_zip_file = ctypes.c_char_p(dest_file.encode("ascii"))

    local_id = ctypes.c_buffer(12)
    nhi_id = ctypes.c_buffer(12)
    error_code = nhi_eii_api.NHI_SendB(
        com_port,
        p_reader_file,
        p_zip_file,
        p_type_code,
        local_id,
        nhi_id,
    )

    out_queue.put((error_code, local_id, nhi_id))


def get_apply_type_sql(apply_type):
    sql = f'ApplyType = "{apply_type}"'

    if apply_type == "補報":
        sql = f"ApplyType IN {tuple(REMEDY_TYPE)}"

    return sql


# 取得療程首次日期
def get_first_course_delta(
    table_widget, row_no, patient_key, card, course, next_case_date
):
    first_case_date = None
    if course == 1:
        first_case_date = table_widget.item(row_no, 1).text()
    else:
        i = 1
        while True:
            previous_case_date = table_widget.item(row_no - i, 1)
            previous_patient_key = table_widget.item(row_no - i, 3)
            previous_card = table_widget.item(row_no - i, 6)
            if previous_case_date is None:
                break

            if previous_patient_key.text() != patient_key:
                break

            previous_case_date = previous_case_date.text()
            previous_card = previous_card.text()
            previous_course = number_utils.get_integer(
                table_widget.item(row_no - i, 7).text()
            )

            if previous_card == card and previous_course == 1:
                first_case_date = previous_case_date

                break

            i += 1

    if first_case_date is not None:
        delta = date_utils.str_to_date(next_case_date) - date_utils.str_to_date(
            first_case_date
        )
    else:
        delta = None

    return delta


# 取得療程首次處置
def get_first_course_treat(table_widget, row_no, patient_key, card, course):
    if course == 1:
        first_treat = string_utils.xstr(table_widget.item(row_no, 10).text())
        return first_treat

    i = 1
    first_treat = None
    while True:
        previous_patient_key_item = table_widget.item(row_no - i, 3)
        if previous_patient_key_item is None:
            break

        previous_patient_key = string_utils.xstr(previous_patient_key_item.text())
        if previous_patient_key != patient_key:
            break

        previous_card = string_utils.xstr(table_widget.item(row_no - i, 6).text())
        previous_course = number_utils.get_integer(
            table_widget.item(row_no - i, 7).text()
        )

        if previous_card == card and previous_course == 1:
            first_treat = string_utils.xstr(table_widget.item(row_no - i, 10).text())
            break

        i += 1

    return first_treat


# 取得療程首次日期
# def get_first_course_delta(table_widget, row_no, patient_key, card, course, next_case_date):
#     first_case_date = None
#     if course == 1:
#         first_case_date = table_widget.item(row_no, 1).text()
#     else:
#         for i in range(course, 0, -1):
#             previous_case_date = table_widget.item(row_no - i, 1)
#             previous_patient_key = table_widget.item(row_no - i, 3)
#             previous_card = table_widget.item(row_no - i, 6)
#             if previous_case_date is None:
#                 continue

#             if previous_patient_key.text() != patient_key:
#                 continue

#             previous_case_date = previous_case_date.text()
#             previous_card = previous_card.text()
#             previous_course = number_utils.get_integer(
#                 table_widget.item(row_no - i, 7).text()
#             )
#             if previous_card == card and previous_course == 1:
#                 first_case_date = previous_case_date
#                 break

#     if first_case_date is not None:
#         delta = date_utils.str_to_date(next_case_date) - date_utils.str_to_date(first_case_date)
#     else:
#         delta = None

#     return delta


# 取得相同卡序日期
def get_duplicated_card(table_widget, row_no, patient_key, card):
    duplicated_case_date = None

    for i in range(row_no, 0, -1):
        previous_patient_key = table_widget.item(i, 3)
        previous_card = table_widget.item(i, 6)
        previous_case_date = table_widget.item(i, 1)

        if (
            previous_patient_key is not None
            and previous_patient_key.text() != patient_key
        ):  # 換人
            break

        if previous_card.text() == card:
            duplicated_case_date = previous_case_date.text()
            break

    return duplicated_case_date


def get_ins_treat_selection_list(start_date=None):
    if start_date is None:
        start_date = datetime.datetime.now().date()

    if start_date >= INS_TREAT_2021_DATE:
        treat_list = SELECTION_ACUPUNCTURE_TREAT + SELECTION_MASSAGE_TREAT
    else:
        treat_list = ACUPUNCTURE_TREAT_2020 + MASSAGE_TREAT_2020

    return treat_list


def get_treat_type_list(start_date=None):
    if start_date is None:
        start_date = datetime.datetime.now().date()

    if start_date >= INS_TREAT_2021_DATE:
        ins_treat_list = SELECT_TREAT_TYPE
    else:
        ins_treat_list = SELECT_TREAT_TYPE_2020

    return ins_treat_list


def get_home_care_ins_code(database, regist_type):
    if regist_type in TOUR_TYPE:  # 山地離島居家醫療
        ins_code = charge_utils.get_ins_code_from_charge_settings(
            database, "診察費", "山地離島地區中醫師訪視費", fuzzy=True
        )
        if ins_code == "":
            ins_code = charge_utils.get_ins_code_from_charge_settings(
                database, "診察費", "山地離島地區居家醫療訪視費", fuzzy=True
            )
    else:
        ins_code = charge_utils.get_ins_code_from_charge_settings(
            database, "診察費", "中醫師訪視費", fuzzy=True
        )
        if ins_code == "":
            ins_code = charge_utils.get_ins_code_from_charge_settings(
                database, "診察費", "居家醫療訪視費"
            )

    return ins_code


def get_area_list(regist_type, division=None):
    if regist_type == "巡迴山地":
        tour_area_list = ["-- 山地鄉 --"] + TOUR_AREA_LEVEL["山地鄉"]
    elif regist_type in ["巡迴偏遠", "前往資源不足地區"]:
        tour_area_list = (
            ["-- 資源不足 --"]
            + TOUR_AREA_LEVEL["資源不足"]
            + ["-- 一級偏遠 --"]
            + TOUR_AREA_LEVEL["一級偏遠"]
            + ["-- 二級偏遠 --"]
            + TOUR_AREA_LEVEL["二級偏遠"]
        )
    elif regist_type == "巡迴離島":
        tour_area_list = (
            ["-- 一級離島 --"]
            + TOUR_AREA_LEVEL["一級離島"]
            + ["-- 二級離島 --"]
            + TOUR_AREA_LEVEL["二級離島"]
            + ["-- 三級離島 --"]
            + TOUR_AREA_LEVEL["三級離島"]
        )
    elif regist_type == "矯正機關內門診":
        if division is None:
            division = "北區業務組"

        tour_area_list = list(CORRECTION_AREA_DICT[division].keys())
    else:
        tour_area_list = []

    return tour_area_list


# 取得矯正機關代號
def get_correction_area_code(system_settings, correction_area=None):
    if correction_area is None:
        correction_area = system_settings.field("矯正機關")

    if correction_area in ["", None]:
        return None

    try:
        division = system_settings.field("健保業務")
        correction_dict = CORRECTION_AREA_DICT[division]
    except Exception:
        return None

    try:
        correction_area_code = correction_dict[correction_area]
    except Exception:
        return None

    return correction_area_code


def get_agent_fee(share_code, diag_share_fee, drug_share_fee):
    agent_fee = None

    if share_code in [
        "003",
        "004",
        "005",
        "006",
        "901",
        "902",
        "903",
        "904",
        "906",
        "907",
        "908",
        "909",
        "910",
        "911",
        "912",
        "913",
        "915",
    ]:
        agent_fee = diag_share_fee + drug_share_fee

    return agent_fee


def get_treatment(database, case_key, primary_treatment, second_treatment, course):
    if second_treatment in ["", None]:
        return primary_treatment

    if primary_treatment == "中度複雜性針灸":
        primary_treatment = "中度針灸"
    elif primary_treatment == "高度複雜性針灸":
        primary_treatment = "高度針灸"
    elif primary_treatment == "中度複雜性針灸合併特殊疾病":
        primary_treatment = "中度針灸合併特殊疾病"

    if second_treatment == "中度複雜性傷科":
        second_treatment = "中度傷科"
    elif second_treatment == "高度複雜性傷科":
        second_treatment = "高度傷科"
    elif second_treatment == "中度複雜性傷科合併特殊疾病":
        second_treatment = "中度傷科合併特殊疾病"

    new_treatment = f"{primary_treatment}合併{second_treatment}"

    if second_treatment in ["中度傷科"] and course >= 2:
        new_treatment += "療程2-6次"
    elif second_treatment in [
        "高度傷科",
        "中度傷科合併特殊疾病",
        "脫臼整復復位",
        "骨折復位",
    ]:
        if course <= 1:
            first_treatment = new_treatment + "起始次"

            sql = f"""
                SELECT CaseDate, PatientKey FROM cases
                WHERE
                    CaseKey = {case_key}
            """
            rows = database.select_record(sql)
            if len(rows) <= 0:
                return first_treatment

            row = rows[0]
            case_date = row["CaseDate"].date()
            patient_key = row["PatientKey"]

            start_date = case_date - datetime.timedelta(days=90)
            sql = f'''
                SELECT CaseDate FROM cases
                WHERE
                    DATE(CaseDate) >= "{start_date}" AND
                    DATE(CaseDate) < "{case_date}" AND
                    PatientKey = {patient_key} AND
                    Treatment = "{first_treatment}"
            '''
            rows = database.select_record(sql)
            if len(rows) > 0:  # 已經做過起始次
                new_treatment += "後續治療"
            else:
                new_treatment = first_treatment
        else:
            new_treatment += "後續治療"

    return new_treatment


def get_medicine_order_count(database, case_key):
    sql = f"""
        SELECT
            prescript.CaseKey
        FROM prescript
            LEFT JOIN presextend ON presextend.PrescriptKey = prescript.PrescriptKey
        WHERE
            prescript.CaseKey = {case_key} AND
            prescript.MedicineSet = 1 AND
            prescript.MedicineName NOT LIKE "%清冠一號%" AND
            prescript.InsCode IS NOT NULL AND
            presextend.ExtendType = "處方簽章" AND
            presextend.Content IS NOT NULL
    """
    rows = database.select_record(sql)

    return len(rows)


def get_home_care_card(database, patient_key, today):
    if patient_key in [None, ""]:
        return "自動取得"

    year = today[:4]
    month = today[5:7]
    first_day = datetime.date(int(year), int(month), 1).strftime("%Y-%m-%d")

    sql = f'''
        SELECT Card FROM cases
        WHERE
            PatientKey = {patient_key} AND
            DATE(CaseDate) >= "{first_day}" AND
            DATE(CaseDate) < "{today}" AND
            TreatType = "居家醫療"
        ORDER BY CaseDate LIMIT 1
    '''
    rows = database.select_record(sql)
    if len(rows) <= 0:
        return "自動取得"

    row = rows[0]
    card = string_utils.xstr(row["Card"])

    return card


# 主要的癌症
def is_main_cancer(icd_code):
    main_cancer = [
        "C77",
        "C780",
        "C781",
        "C782",
        "C783",
        "C787",
        "C792",
        "C793",
        "C795",
        "C797",
    ]
    return any(icd_code.startswith(code) for code in main_cancer)


# 乳癌
def is_breast_cancer(icd_code):
    cancer_list = ["C50", "C7981"]
    return any(icd_code.startswith(code) for code in cancer_list)


# 肝癌
def is_liver_cancer(icd_code):
    cancer_list = ["C22", "C23", "C24"]
    return any(icd_code.startswith(code) for code in cancer_list)


# 肺癌
def is_lung_cancer(icd_code):
    cancer_list = ["C33", "C34"]
    return any(icd_code.startswith(code) for code in cancer_list)


# 大腸癌
def is_colorectal_cancer(icd_code):
    cancer_list = ["C18", "C19", "C20", "C21"]
    return any(icd_code.startswith(code) for code in cancer_list)


# 胃癌
def is_stomach_cancer(icd_code):
    cancer_list = ["C16"]
    return any(icd_code.startswith(code) for code in cancer_list)


# 攝護腺癌
def is_prostate_cancer(icd_code):
    cancer_list = ["C61"]
    return any(icd_code.startswith(code) for code in cancer_list)


# 口腔癌
def is_oral_cancer(icd_code):
    cancer_list = ["C01", "C02", "C03", "C04", "C05", "C06", "C07", "C08", "C09", "C10"]
    return any(icd_code.startswith(code) for code in cancer_list)


# 子宮頸癌
def is_cervical_cancer(icd_code):
    cancer_list = ["C53"]
    return any(icd_code.startswith(code) for code in cancer_list)


# 子宮體癌
def is_endometrial_cancer(icd_code):
    cancer_list = ["C54"]
    return any(icd_code.startswith(code) for code in cancer_list)


# 甲狀腺癌
def is_thyroid_cancer(icd_code):
    cancer_list = ["C73"]
    return any(icd_code.startswith(code) for code in cancer_list)


def get_treat_position_name_by_code(code):
    for name, value in POSITION_DICT.items():
        if value == code:
            return name

    return None  # 找不到時回傳 None 或自訂訊息


def get_auxiliary_name_by_code(code):
    for name, value in AUXILIARY_TREAT_DICT.items():
        if value == code:
            return name

    return None  # 找不到時回傳 None 或自訂訊息
